{
  "taskName": "art-quiz",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/art-quiz/art-quiz.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nВсе сомнения трактуются в пользу студента\nПеред проверкой работы необходимо очистить localStorage браузера или проверять работу в режиме инкогнито. "
    },
    {
      "type": "title",
      "title": "Стартовая страница и навигация +20"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI стартовой страницы приложения. Выполняются требования к вёрстке и оформлению приложения. На стартовой странице есть кнопка, при клике по которой открываются настройки викторины, и две кнопки, при кликах по которым можно выбрать тип вопроса: угадать художника по картине, угадать картину по имени её автора",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "реализована навигация по страницам приложения. Со стартовой страницы при клике по кнопке с типом вопроса пользователь попадает на страницу категорий выбранного типа вопросов. Со страницы категорий пользователь может вернуться на стартовую страницу приложения. Со страницы категорий при клике по карточке категории пользователь попадает на страницу с вопросами категории. На карточке сыгранной категории есть кнопка или ссылка, при клике по которой пользователь попадает  на страницу с результатами прохождения раунда. Со страницы с вопросами и со страницы с результатами пользователь может вернуться на страницу категорий или на стартовую страницу приложения",
      "max": 10
    },
    {
      "type": "title",
      "title": "Настройки +40"
    },
    {
      "type": "subtask",
      "text": "в настройках есть возможность включать/выключать звук, есть регулятор громкости звука. Если звук включён, есть звуковая индикация правильных и неправильных ответов, звуковое сопровождение окончания раунда",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "в настройках есть возможность включать/выключать игру на время. Если выбрана игра на время, на странице с вопросами викторины отображается таймер, отсчитывающий время, которое отведено для ответа на вопрос",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "в настройках можно указать время для ответа на вопрос в интервале от 5 до 30 секунд с шагом в 5 секунд. Если время истекает, а ответа нет, это засчитывается как неправильный ответ на вопрос",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при перезагрузке страницы приложения настройки сохраняются",
      "max": 10
    },
    {
      "type": "title",
      "title": "Страница категорий +30"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI страницы категории. Выполняются требования к вёрстке и оформлению приложения. На странице категорий размещаются карточки категорий. Карточки категорий могут иметь названия, или их можно просто пронумеровать.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "карточка сыгранной категории внешне отличается от карточки категории, которая ещё не игралась",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на карточке сыгранной категории отображается результат прохождения раунда - количество вопросов, на которые был дан правильный ответ",
      "max": 10
    },
    {
      "type": "title",
      "title": "Страница с вопросами +50"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI страницы с вопросами. Выполняются требования к вёрстке и оформлению приложения. Вопросы в викторине идут в том порядке, в каком информация про картины и их авторов размещается в коллекции исходных данных.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "варианты ответов на вопросы генерируются случайным образом. В вариантах ответов на вопросы викторины должен быть правильный ответ и только один. Правильный ответ в разных вопросах должен находиться на разных местах, а не, например, всегда быть только первым. Варианты ответов должны быть разными. В вариантах ответов не должны повторяться картины одного и того же художника.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "правильным и неправильным ответам пользователя соответствуют индикаторы разного цвета",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после того, как ответ выбран, появляется модальное окно с правильным ответом на вопрос и кнопкой \"Продолжить\". При клике по кнопке \"Продолжить\" пользователь переходит к следующему вопросу категории",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после окончания раунда выводится уведомление об окончании раунда и отображается результат прохождения раунда - количество вопросов, на которые был дан правильный ответ. Есть кнопка \"Продолжить\" при клике по которой пользователь перенаправляется на страницу категорий данного типа вопросов",
      "max": 10
    },
    {
      "type": "title",
      "title": "Страница с результатами +50"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI страницы с результатами. Выполняются требования к вёрстке и оформлению приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "страница с результатами содержит превью всех картин категории",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "картины, на вопросы про которые или про их авторов был дан правильный ответ, цветные; картины, на вопросы про которые или про их авторов был дан неправильный ответ, черно-белые",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при клике по картине выводится информация о ней - название, автор, год создания",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если раунд проигрывался повторно и результаты изменились, эти изменения отображаются на странице с результатами",
      "max": 10
    },
    {
      "type": "title",
      "title": "Одновременная загрузка и плавная смена изображений +10"
    },
    {
      "type": "subtask",
      "text": "Плавная смена изображений, картинки сначала загружаются, потом отображаются, нет ситуации, когда пользователь видит частично загрузившиеся изображения. Плавную смену изображений не проверяем: 1) при загрузке и перезагрузке приложения 2) при открытой консоли браузера",
      "max": 10
    },
    {
      "type": "title",
      "title": "Анимация +20"
    },
    {
      "type": "subtask",
      "text": "5 баллов за каждую уникальную сложную анимацию, улучшающую интерфейс и удобство использования приложения, но не больше 20 баллов",
      "max": 20
    },
    {
      "type": "title",
      "title": "Дополнительный функционал на выбор +20"
    },
    {
      "type": "subtask",
      "text": "дополнительными баллами оценивается очень высокое качество оформления приложения, продуманность отдельных деталей интерфейса, улучшающие внешний вид приложения и удобство пользования им, а также выполненный на высоком уровне и сложный в реализации свой собственный дополнительный функционал, существенно улучшающий качество и/или возможности приложения",
      "max": 20
    },
    {
      "type": "title",
      "title": "Ссылки на лучшие работы добавьте, пожалуйста, в эту форму https://forms.gle/C1gXgJv4kGCPiMz9A"
    }
  ]
}
