{
  "taskName": "Async Race",
  "criteria": [
    {
      "type": "title",
      "title": "Basic structure"
    },
    {
      "type": "subtask",
      "text": "There should be two views on the site: \"Garage\" and \"Winners\".",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "\"Garage\" view should contain its name, page number, and the full amount of items in the database (how many car user has in his garage).",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "\"Winners\" view should contain its name, page number, and the full amount of items in the database (how many records the winners table contains).",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "View state should be saved when user switches from one view to another. For example, page number shouldn't be reset, input controls should contain that they contained before switching, etc.",
      "max": 10
    },
    {
      "type": "title",
      "title": "\"Garage\" view"
    },
    {
      "type": "subtask",
      "text": "User should be able to create, update, delete a car, and see the list of the cars. Car has only two attributes: \"name\" and \"color\". For \"delete\"-operation car should be deleted from \"garage\" table as well as from \"winners\".",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "User should be able to select any color from an RGB-Palete and see the picture of the car colored with the color selected and car's name.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Near the car's picture should be buttons to update its attributes or delete it.",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "There should be pagination on the \"Garage\" view (7 cars per one page).",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "There should be a button to create random cars (100 cars per click). Name should be assembled from two random parts, for example \"Tesla\" + \"Model S\", or \"Ford\" + \"Mustang\" (At least 10 different names for each part). Color should be also generated randomly.",
      "max": 10
    },
    {
      "type": "title",
      "title": "Car animation"
    },
    {
      "type": "subtask",
      "text": "Near the car's picture should be buttons for starting / stoping the car engine.",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "User clicks to the engine start button -> UI is waiting for car's velocity answer -> animate the car and makes another request to drive. In case api returned 500 error car animation should be stopped.",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "User clicks to the engine stop button -> UI is waiting for answer for stopping engine -> car returned to it's initial place.",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Start engine button should be disabled in case car is already in driving mode. As well as stop engine button should be disabled when car is on it's initial place.",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Car animation should work fine on any screen (smallest screen size is 500px).",
      "max": 15
    },
    {
      "type": "title",
      "title": "Race animation"
    },
    {
      "type": "subtask",
      "text": "There should be a button to start race. After user clicks this button all the cars on the current page start driving.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "There should be a button to reset race. After user clicks this button all the cars return to it's initial places.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "After some car finishes first user should see the message contains car's name that shows which one has won.",
      "max": 10
    },
    {
      "type": "title",
      "title": "\"Winners\" view"
    },
    {
      "type": "subtask",
      "text": "After some car wins it should be displayed at the \"Winners view\" table.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "There should be pagination (10 winners per one page).",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Table should include the next culumns: \"№\", \"Image of the car\", \"Name of the car\", \"Wins number\", \"Best time in seconds\" (names of the columns can differ). If the same car wins more than once the number of wins should be incremented while best time should be saved only if it's better than the stored one.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "User should be able to sort cars by wins number and by best time (ASC, DESC).",
      "max": 10
    },
    {
      "type": "title",
      "title": "Bugs"
    },
    {
      "type": "penalty",
      "text": "Major bag (implemented functionality works, but after some manipulations it breaks down, and there are some unexpected errors in the browsers' console).",
      "max": -30
    },
    {
      "type": "penalty",
      "text": "Minor bag (implemented functionality works, but after some manipulations it behavior changes, like button does not become enabled after changing some state, but there are not any errors in the browser's console).",
      "max": -10
    }
  ]
}
