{
  "taskName": "COVID-19 Dashboard",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/covid-dashboard.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nВсе сомнения трактуются на пользу студента\nЕсли в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется в браузере Google Chrome последней версии\nАдаптивность проверяем в Toggle device toolbar браузера Google Chrome\nПриложение может быть как на английском, так и на русском языке"
    },
    {
      "type": "title",
      "title": "Вёрстка, дизайн, UI - 30 баллов"
    },
    {
      "type": "subtask",
      "text": "внешний вид приложения соответствует образцу или является его улучшенной версией. Каждый блок информации (таблица, список, карта, график) можно развернуть в полный экран",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "для стандартных разрешений экрана монитора до 1024×768 включительно приложение полностью помещается в экран. При меньшем разрешении экрана допускается наличие вертикальной полосы прокрутки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "вёрстка адаптивная. Минимальная ширина страницы, при которой проверяется корректность отображения приложения, 500рх",
      "max": 10
    },
    {
      "type": "title",
      "title": "Таблица – 40 баллов"
    },
    {
      "type": "subtask",
      "text": "в таблице корректно отображаются указанные в описании задания данные за весь период пандемии",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "данные можно просматривать за последний день (последнюю возвращаемую API дату)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "данные можно просматривать из расчёта на 100 тыс. населения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "данные можно просматривать для выбранной пользователем страны",
      "max": 10
    },
    {
      "type": "title",
      "title": "Список – 50 баллов"
    },
    {
      "type": "subtask",
      "text": "есть список стран для каждой из которых по умолчанию отображается общее количество случаев заболевания за весь период пандемии",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть возможность выбрать для отображения в списке любой другой показатель из тех, которые выводятся в таблице. Список стран сортируется по убыванию по выбранному показателю",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "работает поиск по названию страны ",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "для ввода поискового запроса может использоваться виртуальная клавиатура",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "возле каждой страны выводится изображение её флага",
      "max": 10
    },
    {
      "type": "title",
      "title": "Интерактивная карта – 50 баллов"
    },
    {
      "type": "subtask",
      "text": "на карте условными обозначениями: цветом или размером маркера указывается интенсивность распространения болезни",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть возможность выбрать для отображения интенсивности распространения болезни другой показатель из тех, что могут отображаться в таблице ",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "карта интерактивная, есть возможность пертескивать карту, уменьшать и увеличивать масштаб",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при наведении курсора на страну на карте появляется всплывающая подсказка - название страны и показатель, который в данный момент используется для определения интенсивности распространения болезни",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "у карты есть легенда, для оформления карты используется кастомный дизайн",
      "max": 10
    },
    {
      "type": "title",
      "title": "График – 50 баллов"
    },
    {
      "type": "subtask",
      "text": "есть график, который строится по общему количеству случаев заболевания",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть возможность просмотреть график по любому из выбранных показателей из тех, которые выводятся в таблице",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "при наведении курсора на график появляется всплывающая подсказка с датой, соответствующей этой точке графика и данными по этой дате",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть возможность просмотреть график как для мира в целом, так и для любой выбранной страны",
      "max": 10
    },
    {
      "type": "title",
      "title": "Бонусные баллы за качество приложения"
    },
    {
      "type": "subtask",
      "text": "оригинальный интересный качественный дизайн приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "продуман и реализован не предусмотренный заданием дополнительный функционал",
      "max": 10
    },
    {
      "type": "title",
      "title": "Ссылки на лучшие работы добавьте, пожалуйста, в эту форму https://forms.gle/XAfqcTj9BntkZcdU6"
    }
  ]
}
