{
  "taskName": "js30#1.3-custom-video",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/js30%23/js30-3.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем."
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nВсе сомнения трактуются в пользу студента\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Вёрстка +10"
    },
    {
      "type": "subtask",
      "text": "вёрстка видеоплеера: есть само видео, в панели управления есть кнопка Play/Pause, прогресс-бар, кнопка Volume/Mute, регулятор громкости звука",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс",
      "max": 5
    },
    {
      "type": "title",
      "title": "Кнопка Play/Pause на панели управления +10"
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке Play/Pause запускается или останавливается проигрывание видео",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "внешний вид и функционал кнопки Play/Pause изменяется в зависимости от того, проигрывается ли видео в данный момент",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Прогресс-бар отображает прогресс проигрывания видео. При перемещении ползунка прогресс-бара вручную меняется текущее время проигрывания видео. Разный цвет прогресс-бара до и после ползунка",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При перемещении ползунка регулятора громкости звука можно сделать звук громче или тише. Разный цвет регулятора громкости звука до и после ползунка",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При клике по кнопке Volume/Mute можно включить или отключить звук. Одновременно с включением/выключением звука меняется внешний вид кнопки. Также внешний вид кнопки меняется, если звук включают или выключают перетягиванием регулятора громкости звука от нуля или до нуля",
      "max": 10
    },
    {
      "type": "title",
      "title": "Кнопка Play/Pause в центре видео +10"
    },
    {
      "type": "subtask",
      "text": "есть кнопка Play/Pause в центре видео при клике по которой запускается видео и отображается панель управления",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "когда видео проигрывается, кнопка Play/Pause в центре видео скрывается, когда видео останавливается, кнопка снова отображается",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения",
      "max": 10
    },
    {
      "type": "title",
      "title": "ссылки на самые лучшие работы с интересным дополнительным функционалом добавьте, пожалуйста, в эту форму https: //forms.gle/retrgFivX1ybcVbp9"
    }
  ]
}
