{
  "taskName": "CV",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/cv/cv-stage1.md",
  "criteria": [
    {
      "type": "subtask",
      "text": "вёрстка валидная. Проверить валидность вёрстки: https://validator.w3.org/",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "вёрстка семантическая. В коде страницы присутствуют семантические теги HTML5, например, article, aside, figure, figcaption, footer, header, main, nav, section, используются заголовки h1-h6. 2 балла за каждый уникальный семантический тег HTML5 и за каждый уникальный заголовок h1-h6, но не больше 20 баллов. Заголовок h1 может быть только один",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "для оформления СV используются css-стили. 1 балл за каждый стилизованный элемент, но не больше 10 баллов",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "контент размещается в блоке, который горизонтально центрируется на странице. Фоновый цвет, если он есть, тянется во всю ширину страницы",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "вёрстка адаптивная: ни на одном из разрешений экрана до 320px включительно не появляется горизонтальная полоса прокрутки, при этом всё содержание страницы сохраняется",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть адаптивное бургер-меню. Ссылки в пунктах меню ведут на основные разделы CV. При кликах по пунктам меню реализована плавная прокрутка по якорям. При уменьшении ширины экрана меню становится адаптивным.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице СV присутствует изображение - фото или аватарка автора CV, пропорции изображения не искажены, у изображения есть атрибут alt (может быть пустым)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "контакты для связи и перечень навыков оформлены в виде списка ul > li",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "CV содержит контакты, краткую информацию о себе, навыки, образование, уровень английского",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "CV содержит изображения-ссылки на выполненные вами проекты. При клике по изображению страница проекта открывается в новой вкладке. У каждого проекта есть название, небольшое описание, указан перечень используемых технологий",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "CV выполнено на английском языке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "выполнены требования к репозиторию: есть ссылка на задание, скриншот страницы СV, ссылка на деплой страницы CV на GitHub Pages, указана дата дедлайна, выполнена самооценка (самооценку расписываем по пунктам критериев оценки, указывая балл за каждый пункт)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть видеорезюме автора CV на английском языке. Видеорезюме встраивается в страницу CV как видео, а не в виде кнопки или ссылки. Продолжительность видео 3-5 минут (±15 секунд). В описание видео на YouTube добавлена ссылка на его транскрипцию на английском языке (например, в документе Google Docs).",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию",
      "max": 10
    },
    {
      "type": "title",
      "title": "Ссылки на лучшие CV добавьте, пожалуйста, в форму https://forms.gle/tgC3Y3dn9y2Yu5NF6"
    }
  ]
}
