{
  "taskName": "CV#3. CV. Cross-Check",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/cv/cv-stage0.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "subtask",
      "text": "студент засабмитил в rs app ссылку на своё CV, задеплоенное на gh-pages",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "вёрстка валидная. Для проверки валидности вёрстки используйте сервис https://validator.w3.org/. Валидной вёрстке соответствует надпись \"Document checking completed. No errors or warnings to show.\" В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований",
      "max": 10
    },
    {
      "type": "title",
      "title": "вёрстка семантическая +20\nВ коде странице присутствуют и используются по назначению следующие элементы:\nПод \"используются по назначению\" имеется в виду, что у элементов есть какое-то содержание, соответствующее типу элемента, а не добавлены пустые теги для получения баллов. Правильность использования элементов не проверяется и на балл не влияет."
    },
    {
      "type": "subtask",
      "text": "header, main, footer",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "элемент nav",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "только один заголовок h1",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "заголовки h2",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "в footer есть ссылка на гитхаб автора работы, год создания приложения, логотип курса со ссылкой на курс. Если ссылка в футере ведёт на курс stage0, это не ошибка.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "для оформления СV используются css-стили",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при уменьшении масштаба страницы браузера вёрстка размещается по центру по горизонтали, а не сдвигается в сторону",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице СV есть фото или аватарка автора, пропорции изображения не искажены (т.е. картинка не деформирована, если её размер изменён, сохраняются пропорции исходного изображения), у изображения есть атрибут alt.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "навигация, контакты для связи и перечень навыков оформлены в виде списка ul > li или ul > li > a. Также допускается использование нумерованого списка ol > li или ol > li > a",
      "max": 10
    },
    {
      "type": "title",
      "title": "Содержание CV +30\nCV содержит:"
    },
    {
      "type": "subtask",
      "text": "краткую информацию о себе",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "контакты для связи",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "перечень навыков",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "пример кода. Код добавляется при помощи символов и тегов, а не картинкой",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "перечень выполненных учебных проектов со ссылками на исходный код или страницу приложения",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "информацию об образовании и уровне английского",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "CV выполнено на английском языке",
      "max": 10
    },
    {
      "type": "title",
      "title": "Разница между максимальной оценкой за задание (130 баллов) и максимально возможным количеством баллов за выполнение всех пунктов требований (120 баллов) позволит сгладить возможные ошибки проверяющих в ходе кросс-чека, неточности в описании задания, разное понимание требований задания проверяющим и проверяемым."
    },
    {
      "type": "title",
      "title": "Ссылки на лучшие работы с исключительно высоким качеством выполнения добавьте, пожалуйста, в эту форму https://forms.gle/JP9xCbPQtEZvfJbWA\nОтметить необходимо самые лучшие работы всего вашего набора"
    }
  ]
}
