{
  "taskName": "js30#1.1-eco-sounds",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/js30%23/js30-1.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем."
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nВсе сомнения трактуются в пользу студента\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Вёрстка +10"
    },
    {
      "type": "subtask",
      "text": "есть не меньше пяти интерактивных элементов, с которыми пользователи могут взаимодействовать. Изменение внешнего вида самого элемента и состояния курсора при наведении, плавные анимации",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "в футере приложения есть ссылка на гитхаб автора приложения, год создания приложения, логотип курса со ссылкой на курс",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "При кликах по интерактивным элементам меняется изображение",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При кликах по интерактивным элементам меняется звук",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Активный в данный момент интерактивный элемент выделяется стилем",
      "max": 10
    },
    {
      "type": "title",
      "title": "Кнопка Play/Pause +20"
    },
    {
      "type": "subtask",
      "text": "есть кнопка Play/Pause, при клике по которой можно запустить или остановить проигрывание звука",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "внешний вид и функционал кнопки Play/Pause изменяется в зависимости от того, проигрывается ли в данный момент звук",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Очень высокое качество оформления приложения и/или дополнительный не предусмотренный в задании функционал, улучшающий качество приложения",
      "max": 10
    },
    {
      "type": "title",
      "title": "ссылки на самые лучшие работы с интересным дополнительным функционалом добавьте, пожалуйста, в эту форму https://forms.gle/retrgFivX1ybcVbp9"
    }
  ]
}
