{
  "taskName": "English Puzzle",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/rslang/english-puzzle.md",
  "criteria": [
    {
      "type": "title",
      "title": "Basic scope +40"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI. Интерактивность кликабельных элементов, различные стили для активного и неактивного состояния. Есть стартовый экран",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "карточки со словами выводятся в случайном порядке. При клике по карточкам со словами в блоке с иходными данными, они перемещаются в блок с результатами в том порядке, в котором по ним кликали",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке Check, те карточки со словами, которые находятся на своих позициях подсвечиваются зелёным, карточки, которые находятся не на своих позициях, подсвечиваются красным",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке I don't know слова размещаются в правильном порядке, образуя предложение, отображаются неиспользованные подсказки. Если предложение собрано верно, кнопка Check меняется на кнопку Continue. При клике по кнопке Continue происходит переход к следующему предложению",
      "max": 10
    },
    {
      "type": "title",
      "title": "Advanced scope +70"
    },
    {
      "type": "subtask",
      "text": "можно выбрать уровень сложности и раунд игры. Номера пройденных раундов визуально отличаются. Последний пройденный раунд сохраняется в бекэнде, после запуска игра начинается со следующего за ним раунда",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "можно выбрать подсказку перевод предложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "можно выбрать подсказку произношение предложения. Можно включить и отключить автопроизношение. При проигрывании звука изменяется стиль иконки аудио в блоке с подсказками",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "можно выбрать подсказку фоновый рисунок на карточках со словами",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "слова между блоком с результатами и блоком с исходными данными можно перетягивать мышкой. Также слова можно перетягивать в пределах предложения, которое собирается в блоке с результатами",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при перетягивании слово может помещаться в начало или в конец группы слов, или между уже добавленными словами. Если при перетягивании слово отпустили вне целевого блока, оно возвращается на свою прежнюю позицию",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице статистики отображаются все предложения раунда с их переводами и иконкой аудио. При клике по предложению звучит его произношение. На странице статистики есть разделы I know и I don't know, и кнопка Continue, а также миниатюра картины, собранной в текущем раунде",
      "max": 10
    },
    {
      "type": "title",
      "title": "Hacker scope +70"
    },
    {
      "type": "subtask",
      "text": "реализована авторизация и регистрация нового пользователя. Основная часть приложения, включая стартовый экран, доступна только после успешной авторизации. При перезагрузке приложения данные о пользователе сохраняются",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "реализован logout, который прекращает работу приложения, делает пользователя анонимным и перенаправляет его на страницу авторизации без доступа к основному приложению",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "минимальная ширина страницы, при которой она отображается корректно – 320 рх. На разрешениях меньше десктопного сохраняется максимально возможная часть функционала, внешний вид и работа приложения может изменяться для удобства пользователя",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "карточки со словами выглядят как элементы пазла. По бокам, справа и слева, там, где карточки соприкасаются между собой, у них есть фигурные вырезы, как у пазлов",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "каждому раунду игры соответствует своя уникальная картина - знаменитое произведение живописи. Когда собраны все десять предложений раунда, границы между карточками и слова на них исчезают, пользователь может увидеть картину а также краткие сведения о ней: автор, название, год создания",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "ведётся долгосрочная статистика мини-игры, можно посмотреть когда (дата и время) и с каким результатом в неё играли. После перезагрузки приложения статистика сохраняется. Для хранения статистики используется бекэнд. Если бекэнд не работает или возвращает ошибку, приложение не ломается, при клике по кнопке для вывода долгосрочной статистики выводится соответствующее уведомление",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если бекэнд не работает или возвращает ошибку, приложение не ломается. Возникающие ошибки в ходе работы с API выводятся в соответствующее уведомление",
      "max": 10
    }
  ]
}
