{
  "taskName": "English for kids",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/rslang/english-for-kids.md",
  "criteria": [
    {
      "type": "title",
      "title": "Вёрстка, дизайн, UI\nТребования к оформлению приложения\n- минимальная ширина, при которой приложение отображается корректно – 320 рх\n- все надписи, если это возможно, дублируются картинками или иконками\n- желательны: плавная анимация, интересный и уместный дизайн, большие и удобные кнопки, красочные иконки, красивые картинки, светлые и яркие тона\n- должны присутствовать все элементы пользовательского интерфейса, представленные в демо, однако сам предложенный дизайн приложения не является обязательным и в него можно вносить свои изменения с целью улучшения\n- дизайн конечного приложения должен выглядеть целостно: внешний вид соответствуют приложению, которым будут пользоваться потенциальные пользователи, картинки для карточек слов и категорий использованы хорошего качеcтва и в самом приложении они имеют одинаковый размер и правильные пропорции (отсутствуют какие-либо искажения), все элементы пользовательского интерфейса функционируют исправно, разметка не разваливается при изменении разрешения\n- интерактивность кликабельных элементов - изменение внешнего вида при наведении, разные стили для активного и неактивного состояния"
    },
    {
      "type": "subtask",
      "text": "Вёрстка, дизайн, UI главной страницы приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Вёрстка, дизайн, UI выезжающего меню 1) ссылки в меню рабочие и ведут на страницы с категориями слов 2) ссылка на текущую страницу внешне отличается от остальных 3) выезжающее меню присутствует на всех страницах приложения 4) плавная анимация, меню закрывается как кликом по крестику, так и кликом на любом элементе приложения (кроме самого меню), и кликом по ссылке в самом меню",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Вёрстка, дизайн, UI страницы категории",
      "max": 10
    },
    {
      "type": "title",
      "title": "Режим тренировки"
    },
    {
      "type": "subtask",
      "text": "при клике по карточке звучит произношение слова на английском языке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на каждой карточке есть кнопка, при клике по которой карточка поворачивается, на обратной стороне указан перевод слова. Когда курсор мыши перемещается за границы карточки, она автоматически поворачивается на лицевую сторону",
      "max": 10
    },
    {
      "type": "title",
      "title": "Режим игры"
    },
    {
      "type": "subtask",
      "text": "кликом по переключителю Train/Play включается режим игры. В режиме игры указанные выше возможности режима тренировки отключаются, кнопка, при клике по которой карточка переворачивалась, и текст на карточке скрываются. Появляется кнопка Start game. На карточке остаётся только изображение, которое занимает всю её площадь (если это не противоречит вашему дизайну)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после клика по кнопке Start game звучит английское произношение рандомного слова из тех, что находятся на странице. Для каждой страницы и для каждой игры рандомные слова генерируются по-новой",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после первого клика по кнопке Start game надпись на ней меняется на иконку Repeat, меняется внешний вид кнопки. При клике по кнопке Repeat произношение слова звучит ещё раз",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если пользователь кликнул по активной карточке с неправильным ответом, раздаётся звуковой сигнал error",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если пользователь кликнул по активной карточке с правильным ответом, раздаётся звуковой сигнал correct и после него звучит произношение рандомного слова из тех, которые ещё не звучали",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "карточка с угаданным словом становится неактивной, при этом изменяется её внешний вид. Клики по неактивной карточке звуковыми эффектами не сопровождаются, на счёт игры не влияют",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после начала игры каждый клик по активной карточке является правильным или неправильным ответом. Эти ответы отображаются в виде звёздочек (или других символов) разного цвета в шкале с рейтингом, которая появляется в режиме игры. Если звёздочек слишком много и шкала заполнена ими полностью, предыдущие звёздочки скрываются, а новые продолжают добавляться",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "когда угаданы все слова в категории 1) если все слова угаданы правильно, звучит сигнал success, карточки со словами скрываются, на странице отображается радостный смайлик (или другая картинка) 2) если при угадывании слов были ошибки, звучит сигнал failure, карточки со словами скрываются, на странице отображается грустный смайлик (или другая картинка) и количество допущенных ошибок 3) приложение автоматически перенаправляет на главную страницу со списком категорий",
      "max": 10
    },
    {
      "type": "title",
      "title": "Страница статистики"
    },
    {
      "type": "subtask",
      "text": "страница со статистикой содержит перечень всех категорий, всех слов в каждой категории, перевод каждого слова. На мобильных разрешенияк в таблице со статистикой может присутствовать полоса прокрутки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "возле каждого слова указывается статистика - сколько раз по карточки с данным словом кликали в режиме тренировки, сколько раз данное слово угадывали в режиме игры, сколько ошибок при этом допустили, процент ошибок по каждому слову, или процент правильных ответов по каждому слову. Оба варианта подсчёта являются равноценными и правильными. После перезагрузки приложения статистика сохраняется.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть возможность сортировки данных по алфавиту, для числовых значений - по их величине. Сортировка может происходить в прямом и обратном порядке и должна охватывать весь диапазон данных",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице со статистикой размещены кнопки Repeat difficult words и Reset. Кнопка Reset обнуляет статистику. При клике по кнопке Repeat difficult words открывается страница изучения слов с наибольшим процентом ошибок аналогичная странице категории. На странице Repeat difficult words может размещаться от нуля до восьми слов, в зависимости от того сколько слов угадывалось в режиме игры и при их угадывании были допущены ошибки. После нажатия на кнопку Reset количество слов на странице Repeat difficult words равно нулю",
      "max": 10
    }
  ]
}
