{
  "taskName": "fancy-weather",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/fancy-weather.md",
  "criteria": [
    {
      "type": "title",
      "title": "Вёрстка, дизайн, UI **30 баллов**"
    },
    {
      "type": "subtask",
      "text": "минимальная ширина страницы, при которой она отображается корректно – 320 рх. Все указанные в задании элементы присутствуют как на десктопной, так и на мобильной версии",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "приложение корректно отображается для любого выбранного языка, единиц измерения температуры, указанного в поиске населённого пункта",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "внешний вид приложения внешне соответствует макету или является его улучшенной версией",
      "max": 10
    },
    {
      "type": "title",
      "title": "В блоке Погода за сегодня корректно отображаются данные, относящиеся к текущему местоположению пользователя – **20 баллов**"
    },
    {
      "type": "subtask",
      "text": "данные о погоде и местоположении пользователя",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "дата в указанном в описании задания формате, часы, обновляющие время каждую секунду",
      "max": 10
    },
    {
      "type": "title",
      "title": "В блоке Прогноз погоды на три дня корректно отображаются данные, относящиеся к текущему местоположению пользователя – **10 баллов**"
    },
    {
      "type": "subtask",
      "text": "В блоке Прогноз погоды на три дня корректно отображаются данные, относящиеся к текущему местоположению пользователя",
      "max": 10
    },
    {
      "type": "title",
      "title": "В блоке Геолокационные данные корректно отображаются данные, относящиеся к текущему местоположению пользователя – **20 баллов**"
    },
    {
      "type": "subtask",
      "text": "карта с маской (форма карты отличная от прямоугольной) и маркером населённого пункта",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "координаты в градусах и минутах",
      "max": 10
    },
    {
      "type": "title",
      "title": "Реализован поиск. Если в поиске вводится корректный запрос, все данные на странице, в том числе дата и время, обновляются в соответствии с указанным в поиске населённым пунктом – **50 баллов**"
    },
    {
      "type": "subtask",
      "text": "поиск работает как при нажатии на клавишу Enter в поле поиска, так и при клике на кнопку Поиск",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "поиск корректно работает для разных населённых пунктов - больших и маленьких, столиц и посёлков",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при вводе в поле поиска некорректных запросов приложение не ломается, пользователю выводится уведомление об ошибке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "дата и время указываются для того часового пояса, в котором находится указанный в поле поиска населённый пункт",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если у координаты есть знак минус, он тоже выводится, или возле координаты выводится буква, обозначающая широту (северная (N), южная (S)) и долготу (восточная (E), западная (W))",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "одновременное обновление всех элементов страницы при вводе нового населенного пункта после получения успешного ответа по каждому из запросов (название по локации приходит быстро, а погода, иконки ее и т.п. - медленно). В случае возникновения ошибки по одному из запросов данные не обновляются",
      "max": 10
    },
    {
      "type": "title",
      "title": "При обновлении страницы или клике на кнопку для переключения фонового изображения меняется фоновое изображение – **20 баллов**"
    },
    {
      "type": "subtask",
      "text": "фоновое изображение генерируется с учётом поры года и времени суток указанного в поле поиска населённого пункта (по желанию можно добавлять и другие параметры поиска). Если возникла ошибка в ходе получения картинки, использовать любое стандартное фоновое изображение. Так как API для картинок не всегда возвращает правильный результат, данные о параметрах запроса фонового изображения для удобства в ходе проверки ментором или в процессе кросс чека выведите в консоль",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "плавная смена фонового изображения, изображение сначала загружается и только потом меняется, у изображения есть полупрозрачный оверлей или используется другой способ, обеспечивающий чёткость и контрастность надписей",
      "max": 10
    },
    {
      "type": "title",
      "title": "Переключение единиц измерения температуры – **10 баллов**"
    },
    {
      "type": "subtask",
      "text": "при смене шкалы отображения температур происходит пересчёт температур в соответствии с выбранной шкалой и меняется отображение активной кнопки, позволяющей определить, какая шкала сейчас активна. При перезагрузке страницы сохраняется выбранная пользователем шкала отображения температур",
      "max": 10
    },
    {
      "type": "title",
      "title": "Голосовой поиск по названию населённого пункта – **20 баллов**"
    },
    {
      "type": "subtask",
      "text": "есть индикация активного и неактивного состояния микрофона, активное и неактивное состояние переключаются по клику",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "после того, как название населённого пункта произнесено, поиск срабатывает автоматически, без необходимости кликать на кнопку",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "поиск ведётся на языке отображения страницы, если срабатывает поиск и на другом языке тоже, это не является ошибкой",
      "max": 5
    },
    {
      "type": "title",
      "title": "Голосовое уведомление о погоде на сегодня - **20 баллов**"
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке проигрывания звука есть возможность прослушать звуковое уведомление о прогнозе погоды",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "голосовое уведомление о прогнозе погоды можно запустить произнеся кодовую фразу. Также голосом можно регулировать громкость уведомления. Обратите внимание, голосовое управление работает только при включенном микрофоне",
      "max": 10
    },
    {
      "type": "title",
      "title": "Перевод текста страницы (en/ru/be) – **30 баллов**"
    },
    {
      "type": "subtask",
      "text": "переводится весь текст страницы. Не является ошибкой отсутствие перевода карты",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "перевод на белорусский язык названий дней недели и месяцев",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при перезагрузке страницы сохраняется выбранный пользователем язык",
      "max": 5
    },
    {
      "type": "title",
      "title": "Бонусные баллы за качество приложения – **20 баллов**"
    },
    {
      "type": "subtask",
      "text": "оригинальный интересный качественный дизайн приложения, иконки погоды и кнопки анимированы, для анимации используются ключевые кадры или svg-анимация",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "продуман и реализован не предусмотренный заданием дополнительный функционал",
      "max": 10
    }
  ]
}
