{
  "taskName": "Library#1",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/library/library-part1.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем."
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nВсе сомнения трактуются на пользу студента\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Вёрстка валидная +10"
    },
    {
      "type": "subtask",
      "text": "Вёрстка валидная. Для проверки валидности вёрстки используйте сервис https://validator.w3.org/. Валидной вёрстке соответствует надпись \"Document checking completed. No errors or warnings to show.\" В таком случае баллы за пункт требований выставляем полностью. Если есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за этот пункт. Если есть errors - выставляем 0 баллов.",
      "max": 10
    },
    {
      "type": "title",
      "title": "Вёрстка семантическая +16\nВ коде странице присутствуют следующие элементы\n(указано минимальное количество, может быть больше)"
    },
    {
      "type": "subtask",
      "text": "&lt;header&gt;, &lt;main&gt;, &lt;footer&gt;",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Шесть элементов &lt;section&gt; (по количеству секций)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Только один заголовок &lt;h1&gt;. Если элементов &lt;h1&gt; на странице больше одного, считаем это ошибкой",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Пять заголовков &lt;h2&gt; (легко отличимы на верхних границах секций, имеют единый стиль)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Один элемент &lt;nav&gt; (панель навигации в хедере)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Два списка ul &gt; li &gt; a (панель навигации, ссылки на соцсети в футере)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Семь кнопок &lt;button&gt;",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Два инпута &lt;input&gt; ",
      "max": 2
    },
    {
      "type": "title",
      "title": "Вёрстка соответствует макету +54\nПод оценкой за блок или секцию вы найдете более подробное описание задания, если возникнут вопросы по совпадению с макетом. За нарушения в пунктах, которые можно проверить, снимаем по 2 балла помимо других явных ошибок, но не больше общего количества баллов за блок:"
    },
    {
      "type": "title",
      "title": "Блок <header> +8\nСтараемся, чтобы текст совпадал с макетом. Если есть небольшие отклонения, то главное для нас, чтобы расстояние между элементами меню было одинаковое, 30px."
    },
    {
      "type": "subtask",
      "text": "Элементы меню работают как якоря. При нажатии на один из них нас перебросит наверх соответствующего раздела",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Сами элементы меню при наведении (эффект hover) должны быть интерактивными (решайте сами, должны ли они становиться жирными или подчеркнутыми. Но обязательно курсор должен поменяться на cursor: pointer)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Расстояние от самого меню до иконки пользователя - 40px. Иконка является отдельным элементом, и не входит в &lt;nav&gt;",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Текст \"Brooklyn Public Library\" находится в &lt;h1&gt;",
      "max": 2
    },
    {
      "type": "title",
      "title": "Секция Welcome +4"
    },
    {
      "type": "subtask",
      "text": "Секция Welcome",
      "max": 4
    },
    {
      "type": "title",
      "title": "Секция About +6"
    },
    {
      "type": "subtask",
      "text": "Добавьте все картинки, которые будут использованы в папку с картинками. Даже если отображается всего 3, в папке должны быть все 5",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Расстояния между кнопками пагинации 10px",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Обратите внимание, что кнопки хоть и имеют вид круга, но интерактивная область (область нажатия, выделяемая cursor:pointer) должна быть размером +5px в каждую сторону (круглая, квадратная или со скошенными углами - на ваш выбор).\nТ.е. это будут прозрачные элементы размерами 26x26, внутри которых будут располагаться непосредственно кнопки 16x16",
      "max": 2
    },
    {
      "type": "title",
      "title": "Секция Favorites +8"
    },
    {
      "type": "subtask",
      "text": "Интерактивные кнопки должны иметь структуру input type=\"radio\" + label. Добавьте небольшую область вокруг кнопки и надписи (например, 5px как в примере секции about) для того, чтобы была возможность легче наводить мышку",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Kартинок и описаний - много, для 4х секций. Их стоит добавить в проект. А лучше сразу на страницу, и скрыть с помощью CSS свойств, например display: none;",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Кнопки \"buy\" должны быть интерактивными, плавно менять свой цвет при наведении на них, как указано в макете styleguides",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Кнопка \"own\" не должна быть интерактивной, не должна нажиматься. И на ней должен присутствовать атрибут disabled",
      "max": 2
    },
    {
      "type": "title",
      "title": "Секция CoffeShop +6"
    },
    {
      "type": "subtask",
      "text": "Секция CoffeShop",
      "max": 6
    },
    {
      "type": "title",
      "title": "Секция Contacts +6"
    },
    {
      "type": "subtask",
      "text": "Карту можно вставить просто картинкой. Добавлять ее отдельным сервисом не обязательно",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Везде, где в тексте встречаются цифры в виде телефонного номера, это должны быть ссылки с типом \"tel\" и номером",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Там, где в тексте встречается текст с именем контактного лица, это должна быть ссылка с типом \"mailto\" и адресом почты (например, AmandaHirst@gmail.com)",
      "max": 2
    },
    {
      "type": "title",
      "title": "Секция LibraryCard +8"
    },
    {
      "type": "subtask",
      "text": "\"Find your Library card\" - это должна быть форма с полями input",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "Все 3 кнопки должны быть интерактивными, плавно менять свой цвет при наведении на них, как указано в макете styleguides",
      "max": 4
    },
    {
      "type": "title",
      "title": "Блок <footer> +8"
    },
    {
      "type": "subtask",
      "text": "Адрес библиотеки должен быть ссылкой (место на карте, например)",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "Иконки соцсетей также должны быть ссылками (можете вставить свои соцсети или любые другие аккаунты этих сервисов)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Вместо Username должно быть ваше имя, как оно пишется на английском языке и ссылка на GitHub",
      "max": 2
    },
    {
      "type": "title",
      "title": "Общие требования к верстке +20"
    },
    {
      "type": "subtask",
      "text": "Для построения сетки используются флексы или гриды (display: flex... или display: grid...)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, а не сдвигается в сторону. Для этого должна быть обертка вокруг всей страницы, которая выравнивается по центру. Фон за рамками страницы может быть черным, белым или любого оттенка серого.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Изображения добавлены в формате .jpg (.jpeg) или .png",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Есть favicon. В макете иконки нет, поэтому можно сгенерировать самому с помощью сервиса favicon-generator. Иконка должна содержать 3 буквы \"BPL\" (Brooklyn Public Library)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Плавная прокрутка по якорям",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "В футере название ссылки Username заменено и ведет на GitHub студента",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "В футере ссылка The Rolling Scopes School ведет на страницу курса https://rs.school/js-stage0/",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Интерактивность элементов согласно макету. Интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы",
      "max": 2
    }
  ]
}