{
  "taskName": "library-part3",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/library/library-part3.md",
  "information": "",
  "criteria": [
    {
      "type": "title",
      "title": "Этап 1: Пользователь не зарегистрирован"
    },
    {
      "type": "title",
      "title": "Ограниченная карусель в блоке About"
    },
    {
      "type": "subtask",
      "text": "Карусель реагирует на нажатие кнопок (кнопки под каруселью и стрелочки слева и справа в мобильной версии) и происходит анимация перелистывания.",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "На экране шириной 1440px проверяем, чтобы было доступно 2 других скрытых картинки. При каждом нажатии выезжает следующая, и так до границ справа и слева.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Выделенная кнопка под каруселью (имеется ввиду кнопка соответствующая активному слайду и которая имеет коричневый цвет) - неактивная.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Если анимация карусели не успела завершиться, при этом нажата была следующая кнопка, то картинка не должна зависнуть в промежуточном состоянии.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "На экране шириной 768px проверяем, чтобы было доступно 4 других скрытых картинки. Для этого меняем разрешение и перезагружаем страницу. Теперь доступных перемещений становится 5.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Неактивными становятся не только выделенные кнопки, но и стрелочки на границах карусели.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Слайдер в блоке Favorites"
    },
    {
      "type": "subtask",
      "text": "\"Слайдер\" реагирует на нажатие кнопок панели навигации и происходит анимация затухания и проявления.",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "На любой ширине экрана все 4 карточки с книгами одновременно будут плавно затухать, а затем плавно проявляться следующие.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Анимация может быть прервана следующим нажатием на кнопку выбора поры года, но при этом анимация не должна застывать в промежуточном состоянии. Если анимация не была прервана следующим нажатием кнопки, то она должна отрабатывать до конца.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Во время анимаций высота блока Favorites не должна меняться.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "❗Панель навигации \"слайдера\" сделана по технологии \"sticky\" для разрешений с одним рядом книг (768px и меньше), т.е. опускается вниз вместе со скроллом страницы, прилипая к верхней части экрана, в рамках блока Favorites. ",
      "max": 2
    },
    {
      "type": "title",
      "title": "До авторизации"
    },
    {
      "type": "subtask",
      "text": "В блоке Favorites все кнопки должны иметь имя Buy, а не Own.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Этап 2: Пользователь на этапе регистрации"
    },
    {
      "type": "title",
      "title": "Меню авторизации при нажатии на иконку пользователя"
    },
    {
      "type": "subtask",
      "text": "Нажатие на иконку пользователя в хедере открывает меню, которое должно оказаться под иконкой таким образом, что правый верхний угол меню находится в той же точке, что и нижний правый угол контейнера с иконкой в хедере. Меню под иконкой.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "На разрешении 768px, при открытом бургер-меню, оно закрывается и открывается меню авторизации.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "То же верно и в обратную сторону, кнопка бургер-меню должна быть доступна при открытом меню авторизации. ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Нажатие на любую область или элемент вне меню приводят к закрытию меню авторизации.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Модальное окно REGISTER"
    },
    {
      "type": "subtask",
      "text": "Дизайн модального окна соответствует макету. +15 (позже появятся пункты оценки по каждому элементу в отдельности).",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "При нажатии на кнопку Register в открытом меню авторизации появляется модальное окно REGISTER, где есть поля First name, Last name, E-mail и Password.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При нажатии кнопки Sign Up в блоке Digital Library Cards также появляется модальное окно REGISTER.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Окно центрировано, а область вокруг затемнена (насколько затемнена - не имеет значения). ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При нажатии на крестик в углу окна, или на затемнённую область вне этого окна, оно закрывается.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "В данном случае, ограничения по полям - все поля должны быть не пустыми.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Пароль должен быть не короче 8 символов. ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "В поле E-mail должна быть валидация типа email. ",
      "max": 2
    },
    {
      "type": "title",
      "title": "Окончание регистрации"
    },
    {
      "type": "subtask",
      "text": "Данные сохраняются в хранилище localStorage, в том числе и пароль, хотя в реальной жизни так делать нельзя.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Иконка пользователя меняется на заглавные буквы имени.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Отображение страницы приходит в состояние после авторизации (этап 4).",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Будет сгенерирован девятизначный Card Number случайным образом в формате 16-ричного числа.",
      "max": 2
    },
    {
      "type": "title",
      "title": "При наличии регистрации, но будучи не авторизованным"
    },
    {
      "type": "subtask",
      "text": "Блок Digital Library Cards. Если введённые имя и номер карты совпадают с данными пользователя, то отображается панель с информацией, вместо кнопки Check the card на 10 секунд. ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Там же после отображения информации, кнопка возвращается в прежнее состояние, а поля в форме сбрасываются.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Этап 3: Пользователь на этапе входа в учётную запись после регистрации."
    },
    {
      "type": "title",
      "title": "Модальное окно LOGIN"
    },
    {
      "type": "subtask",
      "text": "Дизайн модального окна соответствует макету. +15 (позже появятся пункты оценки по каждому элементу в отдельности).",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "При нажатии на кнопку Log In появляется модальное окно LOGIN, где есть поля E-mail or readers card и Password.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При нажатии кнопки Log In в блоке Digital Library Cards также появляется модальное окно LOGIN.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Окно центрировано, а область вокруг затемнена (насколько затемнена - не имеет значения).",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При нажатии на крестик в углу окна, или на затемнённую область вне этого окна, оно закрывается.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Для авторизации все поля должны быть не пустыми.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Пароль должен быть не короче 8 символов.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Блок Favorites"
    },
    {
      "type": "subtask",
      "text": "Если пользователь ещё не вошёл в учётную запись, то при нажатии на любую кнопку Buy открывается модальное окно LOGIN. ",
      "max": 2
    },
    {
      "type": "title",
      "title": "Этап 4: Пользователь после входа в учётную запись"
    },
    {
      "type": "title",
      "title": "Меню профиля при нажатии на иконку с инициалами пользователя"
    },
    {
      "type": "subtask",
      "text": "При наведении курсором на иконку пользователя должно отображаться полное имя пользователя (атрибут title).",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Нажатие на иконку пользователя в хедере открывает меню, которое должно оказаться под иконкой таким образом, что правый верхний угол меню находится в той же точке, что и нижний правый угол контейнера с иконкой в хедере. Меню под иконкой.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "На разрешении 768px при открытом бургер-меню, оно закрывается и открывается меню авторизации.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "То же верно и в обратную сторону, кнопка бургер-меню должна быть доступна.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Нажатие на любую область или элемент вне меню приводят к закрытию меню профиля.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "❗Вместо надписи Profile отображается девятизначный Card Number. Для Card Number можно использовать меньший шрифт чтобы надпись вметилась в контейнер.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Нажатие на кнопку My Profile открывает модальное окно MY PROFILE.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Нажатие на кнопку Log Out приводит к выходу пользователю из состояния авторизации, возвращаемся к этапу #1.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Модальное окно MY PROFILE"
    },
    {
      "type": "subtask",
      "text": "Дизайн модального окна соответствует макету. +15 (позже появятся пункты оценки по каждому элементу в отдельности).",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "Счетчик для Visits отображает, сколько раз пользователь проходил процесс авторизации, включая самый первый - регистрацию.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Счетчик для Books отображает, сколько у пользователя книг находятся в состоянии Own. Значение варьируется 0-16. ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Рядом с Card Number есть кнопка, нажатие на которую копирует код карты клиента в буфер обмена.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Окно центрировано, а область вокруг затемнена (насколько затемнена - не имеет значения).",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При нажатии на крестик в углу окна, или на затемненную область вне этого окна, оно закрывается.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Блок Favorites"
    },
    {
      "type": "subtask",
      "text": "При нажатии на любую кнопку Buy, еще до покупки абонемента, открывается модальное окно BUY A LIBRARY CARD.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "При нажатии на любую кнопку Buy, после покупки абонемента, меняет вид кнопки на неактивную Own, добавляя единицу к счетчику книг в профиле.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Кроме того после нажатия обновляется не только счетчик, но и название книги должно отобразится в разделе Rented Books. Название формируется по принципу <название книги>, <автор книги>. В случае если название книги слишком длинное или список стал слишком большой список книг в блоке Rented Books становится скроллируемым (по необходимости горизонтально/ вертикально или оба скролла сразу) Тайтл Rented Books скроллироваться не должен",
      "max": 2
    },
    {
      "type": "title",
      "title": "Модальное окно BUY A LIBRARY CARD"
    },
    {
      "type": "subtask",
      "text": "❗Модальное окно нужно сделать шириной 640px. Будет это обрезка по 5px по бокам, или просто уменьшение длины с сохранением сетки - значения не имеет, хотя при правильной сеточной структуре, сделать это будет намного проще.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Дизайн модального окна соответствует макету. +15 (позже появятся пункты оценки по каждому элементу в отдельности).",
      "max": 15
    },
    {
      "type": "subtask",
      "text": "При нажатии на крестик в углу окна, или на затемнённую область вне этого окна, оно закрывается. ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Для того, чтобы кнопка Buy была активна, все поля должны быть не пустыми.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Bank card number должен содержать 16 цифр. С пробелами каждые 4 символа или нет - значения не имеет.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Expiration code содержит 2 поля с ограничением в 2 цифры.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "CVC должен содержать 3 цифры.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Блок Digital Library Cards"
    },
    {
      "type": "subtask",
      "text": "При наличии авторизации вместо кнопки Check the Card будут отображаться данные пользователя и бейджи, как на дизайне LibraryCard after login in account.",
      "max": 2
    }
  ]
}
