{
  "taskName": "momentum",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/momentum/momentum-stage1.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nЕсли в консоли есть ошибки, связанные с запросами к API, например  429 (Too Many Requests), проверьте приложение ещё раз позже\nВсе сомнения трактуются в пользу студента\nПеред проверкой следующей работы необходимо очистить localStorage браузера. "
    },
    {
      "type": "title",
      "title": "Часы и календарь +15"
    },
    {
      "type": "subtask",
      "text": "время выводится в 24-часовом формате, например: 21:01:00",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "время обновляется каждую секунду - часы идут. Когда меняется одна из цифр, остальные при этом не меняют своё положение на странице (время не дёргается)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "выводится день недели, число, месяц, например: \"Воскресенье, 16 мая\" / \"Sunday, May 16\" / \"Нядзеля, 16 траўня\"",
      "max": 5
    },
    {
      "type": "title",
      "title": "Приветствие +10"
    },
    {
      "type": "subtask",
      "text": "текст приветствия меняется в зависимости от времени суток (утро, день, вечер, ночь). Проверяется соответствие приветствия текущему времени суток",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "пользователь может ввести своё имя. При перезагрузке страницы приложения имя пользователя сохраняется",
      "max": 5
    },
    {
      "type": "title",
      "title": "Смена фонового изображения +20"
    },
    {
      "type": "subtask",
      "text": "ссылка на фоновое изображение формируется с учётом времени суток и случайного номера изображения (от 01 до 20). Проверяем, что при перезагрузке страницы фоновое изображение изменилось. Если не изменилось, перезагружаем страницу ещё раз",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "изображения можно перелистывать кликами по стрелкам, расположенным по бокам экрана.Изображения перелистываются последовательно - после 18 изображения идёт 19 (клик по правой стрелке), перед 18 изображением идёт 17 (клик по левой стрелке)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "изображения перелистываются по кругу: после двадцатого изображения идёт первое (клик по правой стрелке), перед 1 изображением идёт 20 (клик по левой стрелке)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при смене слайдов важно обеспечить плавную смену фоновых изображений. Не должно быть состояний, когда пользователь видит частично загрузившееся изображение или страницу без фонового изображения. Плавную смену фоновых изображений не проверяем: 1) при загрузке и перезагрузке страницы 2) при открытой консоли браузера 3) при слишком частых кликах по стрелкам для смены изображения",
      "max": 5
    },
    {
      "type": "title",
      "title": "Виджет погоды +15"
    },
    {
      "type": "subtask",
      "text": "при перезагрузке страницы приложения указанный пользователем город сохраняется, данные о нём хранятся в local storage",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "для указанного пользователем населённого пункта выводятся данные о погоде, если их возвращает API. Данные о погоде включают в себя: иконку погоды, описание погоды, температуру в °C, скорость ветра в м/с, относительную влажность воздуха в %. Числовые параметры погоды округляются до целых чисел",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "выводится уведомление об ошибке при вводе некорректных значений, для которых API не возвращает погоду (пустая строка или бессмысленный набор символов)",
      "max": 5
    },
    {
      "type": "title",
      "title": "Виджет цитата дня +10"
    },
    {
      "type": "subtask",
      "text": "при загрузке страницы приложения отображается рандомная цитата и её автор",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при перезагрузке страницы цитата обновляется (заменяется на другую). Есть кнопка, при клике по которой цитата обновляется (заменяется на другую)",
      "max": 5
    },
    {
      "type": "title",
      "title": "Аудиоплеер +15"
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке Play/Pause проигрывается первый трек из блока play-list, иконка кнопки меняется на Pause",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке Play/Pause во время проигрывания трека, останавливается проигрывание трека, иконка кнопки меняется на Play",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "треки пролистываются по кругу - после последнего идёт первый (клик по кнопке Play-next), перед первым - последний (клик по кнопке Play-prev)",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "трек, который в данный момент проигрывается, в блоке Play-list выделяется стилем",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "после окончания проигрывания первого трека, автоматически запускается проигрывание следующего. Треки проигрываются по кругу: после последнего снова проигрывается первый.",
      "max": 3
    },
    {
      "type": "title",
      "title": "Продвинутый аудиоплеер (реализуется без использования библиотек) +20"
    },
    {
      "type": "subtask",
      "text": "добавлен прогресс-бар в котором отображается прогресс проигрывания",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "при перемещении ползунка прогресс-бара меняется текущее время воспроизведения трека",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "над прогресс-баром отображается название трека",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "отображается текущее и общее время воспроизведения трека",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "есть кнопка звука при клике по которой можно включить/отключить звук",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "добавлен регулятор громкости, при перемещении ползунка регулятора громкости меняется громкость проигрывания звука",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "можно запустить и остановить проигрывания трека кликом по кнопке Play/Pause рядом с ним в плейлисте",
      "max": 3
    },
    {
      "type": "title",
      "title": "Перевод приложения на два языка (en/ru или en/be) +15"
    },
    {
      "type": "subtask",
      "text": "переводится язык и меняется формат отображения даты",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "переводится приветствие и placeholder",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "переводится прогноз погоды в т.ч описание погоды и город по умолчанию",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "переводится цитата дня т.е цитата отображается на текущем языке приложения. Сама цитата может быть другая",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "переводятся настройки приложения, при переключении языка приложения в настройках, язык настроек тоже меняется",
      "max": 3
    },
    {
      "type": "title",
      "title": "Получение фонового изображения от API +10\nПункт считается выполненным, если фоновые изображения, полученные от API, отвечают требованиям к фоновым изображениям: их можно перелистывать кликами по стрелкам, обеспечивается плавная смена фоновых изображений, ссылка на фоновое изображение формируется с учётом времени суток, если пользователь не указал другие теги для их получения. Не проверяем и не реализуем последовательное перелистывание изображений и перелистывание изображений по кругу."
    },
    {
      "type": "subtask",
      "text": "в качестве источника изображений может использоваться Unsplash API",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "в качестве источника изображений может использоваться Flickr API",
      "max": 5
    },
    {
      "type": "title",
      "title": "Настройки приложения +20"
    },
    {
      "type": "subtask",
      "text": "в настройках приложения можно указать язык приложения (en/ru или en/be) ",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "в настройках приложения можно указать источник получения фото для фонового изображения: коллекция изображений GitHub, Unsplash API, Flickr API",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "если источником получения фото указан API, в настройках приложения можно указать тег/теги, для которых API будет присылает фото",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "в настройках приложения можно скрыть/отобразить любой из блоков, которые находятся на странице: время, дата, приветствие, цитата дня, прогноз погоды, аудиоплеер, список дел/список ссылок/ваш собственный дополнительный функционал",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "Скрытие и отображение блоков происходит плавно, не влияя на другие элементы, которые находятся на странице, или плавно смещая их",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "настройки приложения сохраняются при перезагрузке страницы",
      "max": 5
    },
    {
      "type": "title",
      "title": "Дополнительный функционал на выбор. Достаточно выполнить только один из предложенных пунктов"
    },
    {
      "type": "subtask",
      "text": "ToDo List - список дел (как в оригинальном приложении) или Список ссылок (как в оригинальном приложении) или Свой собственный дополнительный функционал, по сложности аналогичный предложенным",
      "max": 10
    }
  ]
}
