{
  "taskName": "momentum",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/momentum/momentum.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nВсе сомнения трактуются на пользу студента\nЕсли в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Если прогноз погоды или смена цитаты не работают, посмотрите в консоль браузера. Код ошибки 403 или 501 говорит о проблеме с доступом к API. В таком случае приложение следует проверить позже - через несколько часов или на следующий день. Баллы при этом снижать не нужно, это проблема сервиса, а не приложения. "
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется в браузере Google Chrome последней версии\nАдаптивность проверяем в Toggle device toolbar браузера Google Chrome\nПри проверке адаптивности нужно иметь в виду, что в Google Chrome масштаб регулируется автоматически. Поэтому прежде чем снимать баллы за визуально слишком мелкий шрифт, обратите внимание на масштаб\nПриложение может быть как на английском, так и на русском языке"
    },
    {
      "type": "title",
      "title": "Базовая функциональность"
    },
    {
      "type": "subtask",
      "text": "время выводится в 24-часовом формате, обновляется каждую секунду",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "выводится день недели, дата, месяц",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "можно ввести имя пользователя и его цель. Для ввода данных используется клавиша Enter. Не являются ошибкой дополнительные способы ввода данных, например, при потере фокуса, как в исходном проекте",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "имя пользователя и его цель сохраняются в local storage и отображаются после обновления страницы",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "фоновое изображение и приветствие изменяются в зависимости от времени суток (утро, день, вечер, ночь)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при клике в поле ввода текст, который там был, исчезает, если пользователь ничего не ввёл или ввёл пустую строку, текст восстанавливается. Не является ошибкой исчезновение текста только после того, как пользователь начал что-то печатать в поле ввода. Не проверяем поведение поля ввода при введении строки, состоящей из одних пробелов или знаков препинания и т.д.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Смена фонового изображения"
    },
    {
      "type": "subtask",
      "text": "фоновые изображения меняются каждый час и выбираются в зависимости от времени суток (утро, день, вечер, ночь). Для проверки можно открыть приложение в хх часов 59 минут и подождать пару минут. Смена изображений запускается в 00 минут 00 секунд, но может занять некоторое время.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "есть кнопка, при клике по которой можно пролистать все фоновые изображения за сутки. Если кнопка смены изображений на время перехода одного изображения в другое становится неактивной, это не является ошибкой",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "изображения пролистываются в том же порядке, в котором они менялись бы в реальном времени (утро, день, вечер, ночь), начиная с того, которое соотвествует текущему времени суток. После пролистывания всех 24 картинок мы должны вернуться к первой и пойти по новому кругу (тому же самому)",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при обновлении страницы формируется новый список фоновых изображений на текущие сутки. То есть при обновлении страницы изображение скорей всего изменится (есть небольшая вероятность что новый список вернёт ту же картинку для текущего часа, тогда обновите страницу ещё раз).",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке для обновления фонового изображения происходит плавная смена фоновых изображений, нет ситуации, когда пользователь видит частично загрузившееся изображение. Плавность смены фоновых изображений проверяем только в полноэкранном режиме.",
      "max": 2
    },
    {
      "type": "title",
      "title": "Цитата дня"
    },
    {
      "type": "subtask",
      "text": "при загрузке приложения выводится цитата или другой короткий текст (высказывание, шутка, анекдот и т.д.) Наличие или отсутствие автора цитаты не является ошибкой",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при перезагрузке страницы цитата заменяется на другую (есть небольшая вероятность что API вернёт ту же цитату, тогда обновите страницу ещё раз) ",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "есть кнопка, при клике по которой меняется цитата",
      "max": 2
    },
    {
      "type": "title",
      "title": "Прогноз погоды"
    },
    {
      "type": "subtask",
      "text": "в приложении есть возможность указать город",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "для указанного пользователем города выводится прогноз погоды",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "указанный пользователем город сохраняется в local storage и отображается при обновлении страницы. Также отображается прогноз погоды для него",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "прогноз погоды включает в себя данные о температуре, относительной влажности воздуха, скорости ветра",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "прогноз погоды включает в себя иконку погоды. Иконка погоды генерируется по тем данным, которые возвращает API. Для другого города иконка может быть другой. Проверяем не только наличие иконки, но и меняется ли она при изменении прогноза погоды",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "если пользователь вводит пустую строку (поставил курсор, нажал Enter), отображается прежний город и прогноз погоды для него. Если пользователь вводит данные, для которых API погоды не возвращает результат, прогноз погоды не выводится, выводится уведомление об ошибке в человекочитаемом формате (подойдёт любой осмысленный текст или слово). Для строки состоящей из одних пробелов, или знаков препинания, или одних цифр поведение не проверяем",
      "max": 2
    },
    {
      "type": "title",
      "title": "Адаптивный дизайн"
    },
    {
      "type": "subtask",
      "text": "элемены приложения оптимально занимают площадь страницы. Проверям что нет ситуации когда все элементы прижаты к верху, низу, боку страницы, что они имеют достаточный размер, что автор приложил хоть какие-то усилия для размещения элементов на странице, а не просто добавил их. Соответствие приложения вашему вкусу не проверяем и не оцениваем",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "приложение корректно отображается как на компьютере, так и на мобильных устройствах. Отсутствует горизонтальная полоса прокрутки. На мобильных устройствах (768px и меньше) вертикальная полоса прокрутки может присутствовать. Минимальное разрешение экрана, при котором проверяем корректность отображения приложения - 320px",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при смене даты и времени, смене цитаты, смене фонового изображения, содержание страницы не дёргается, размеры блоков остаются прежними, кнопки для смены цитаты и смены фонового изображения остаются на своих местах",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "шрифт достаточного размера (не меньше 14рх) и контрастности, хорошо читается на любом фоне. Проверяем визуально, если есть сомнения, размер шрифта смотрим в DevTools браузера, для проверки контрастности используем рекомендованный в задании инструмент.",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "интерактивность кликабельных элементов. Стили при наведении, фокусе, клике меняются плавно",
      "max": 2
    },
    {
      "type": "title",
      "title": "Ссылки на лучшие работы добавьте, пожалуйста, в эту форму https://forms.gle/Xc9RVjEWTTGF6ubK8"
    }
  ]
}
