{
  "taskName": "Movie Search",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/movie-search.md",
  "criteria": [
    {
      "type": "title",
      "title": "Если  в ходе проверки задания не работают запросы к API, следует обратить внимание на код ошибки. Если возникла ошибка со статусом 401 Unauthorized с сообщением Request limit reached, то стоит связаться с автором работы, чтобы он смог сгенерировать новый ключ, или подождать определенное время, когда можно будет вновь выполнять запросы с указанным ключом"
    },
    {
      "type": "title",
      "title": "Возможна проблема со сторонним свайпером, когда при переходе в режим эмуляции мобильного устройства в Chrome Dev Tools не работают свайпы. В данном случае необходимо, не закрывая Dev Tools, обновить страницу и попробовать сделать свайпы по контейнеру с карточками"
    },
    {
      "type": "title",
      "title": "Basic scope +60"
    },
    {
      "type": "subtask",
      "text": "вёрстка. Минимальная ширина, при которой приложение отображается корректно – 320 рх. На разрешениях меньше десктопного виртуальная клавиатура может скрываться",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "дизайн, UI. Выполняются требования к оформлению приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "поиск: при открытии приложения курсор находится в строке поиска; автозаполнение поля ввода отключено (нет выпадающего списка с предыдущими запросами); есть placeholder; поисковый запрос можно ввести как нажатием клавиши Enter, так и кликом по кнопке Search или аналогичной; после ввода поискового запроса и отображения результатов поиска, набранный запрос отображается в поле поиска, в поле ввода есть кнопка Очистить, которая визуально представлена в виде крестика. При клике по кнопке Очистить поле ввода очищается",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "при отправке запроса и ожидания ответа от сервера присутствует индикация процесса загрузки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при вводе в поле поиска корректного поискового запроса, по которому API возвращает результат, обновляются данные о фильмах",
      "max": 10
    },
    {
      "type": "title",
      "title": "Advanced scope +90"
    },
    {
      "type": "subtask",
      "text": "при вводе некорректного запроса, по которому API возвращает ошибку, приложение не ломается, выводится уведомление 'No results were found for … '",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "ошибки, возникающие во время выполнения запросов к API, обрабатываются и выводятся в область уведомления об ошибках",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при вводе запроса на русском языке поисковый запрос переводится на английский язык, выводится уведомление 'Showing results for … '. **Если у вас не отображаются переводы слов, проверьте, не связано ли это с блокировкой Яндекса",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на карточке с фильмом указывается рейтинг IMDb",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "название фильма является ссылкой на видеогалерею даного фильма на сайте https://www.imdb.com",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "реализован адаптивный слайдер/свайпер, карточки с фильмами можно перелистывать как кликами по стрелкам, так и пролистывать пальцем или мышкой",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при достижении конца слайдера/свайпера происходит загрузка следующей страницы поискового запроса",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "слайды меняются плавно, без рывков и проскакиваний нескольких слайдов, при смене поискового запроса данные сначала загружаются, потом отображаются, плавная смена фонового изображения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "карточки с фильмами отображаются на странице только после полной загрузки контента (нет постепенной подгрузки картинок)",
      "max": 10
    },
    {
      "type": "title",
      "title": "Hacker scope +30"
    },
    {
      "type": "subtask",
      "text": "реализован дополнительный, не предусмотренный заданием функционал. Дополнительный функционал оценивается с точки зрения его уместности и соответствия задачам приложения, сложности реализации, полезности для пользователя",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "поисковый запрос можно набирать на виртуальной клавиатуре. Есть возможность переключения языка клавиатуры кликом мышки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "поисковый запрос можно отправить, кликая мышкой по кнопке Enter на виртуальной клавиатуре. Поисковый запрос можно редактировать при помощи виртуальной клавиатуры перемещаясь стрелками вправо-влево и вводя текст на позицию курсора",
      "max": 10
    }
  ]
}
