{
    "taskName": "Not Fight Club Codejam",
    "github": "https://github.com/rolling-scopes-school/tasks/tree/master/tasks/notFightClub",
    "criteria": [
        {
            "type": "title",
            "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем."
        },
        {
            "type": "title",
            "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии.\nВсе сомнения трактуются в пользу студента.\nЕсли сомневаетесь снимать баллы или нет - не снимайте."
        },
        {
            "type": "title",
            "title": "Демо можно посмотреть здесь: https://github.com/rolling-scopes-school/tasks/tree/master/tasks/notFightClub (ссылка под названием Демо)"
        },
        {
            "type": "title",
            "title": "Максимальный балл: 170"
        },
        {
            "type": "title",
            "title": "1. Экран регистрации (10 баллов)"
        },
        {
            "type": "subtask",
            "text": "Инпут должен позволить игроку ввести своё имя. После ввода имени данное имя будет использоваться во всех остальных экранах, поэтому важно его где-то хранить.",
            "max": 10
        },
        {
            "type": "title",
            "title": "2. Домашняя страница (5 баллов)"
        },
        {
            "type": "subtask",
            "text": "Имеет стартовую кнопку, по нажатию которой создаётся новый бой и открывается страница с боем.",
            "max": 5
        },
        {
            "type": "title",
            "title": "3. Страница персонажа (25 баллов). Содержит аватар персонажа, его имя и список побед и поражений."
        },
        {
            "type": "subtask",
            "text": "На странице есть аватар",
            "max": 5
        },
        {
            "type": "subtask",
            "text": "На странице есть список побед, поражений и имя игрока",
            "max": 5
        },
        {
            "type": "subtask",
            "text": "На странице есть возможность выбрать новый аватар (в демо реализовано через наведение на аватар и дополнительное окно. Однако для задания не обязательно делать это именно таким способом — главное, чтобы аватар можно было сменить). Изображения можно взять в интернете и помним, что надо соблюдать рамки приличия :)",
            "max": 15
        },
        {
            "type": "title",
            "title": "4. Страница настроек (10 баллов)"
        },
        {
            "type": "subtask",
            "text": "Позволяет сменить имя игрока. Так же как и в случае с аватаром, можно придумать свой способ, но главное, чтобы была такая возможность и новое имя показывалось в других частях игры.",
            "max": 10
        },
        {
            "type": "title",
            "title": "5. Страница с боем (100 баллов)"
        },
        {
            "type": "subtask",
            "text": "На странице есть игрок и противник и интерактивный счётчик здоровья, который меняется согласно логике боя.",
            "max": 20
        },
        {
            "type": "subtask",
            "text": "При создании боя противник выбирается из заранее созданного пула (имеется в виду, что у вас есть несколько противников (минимум 2) с разными настройками).",
            "max": 5
        },
        {
            "type": "subtask",
            "text": "Есть полная рабочая механика боя согласно требованиям.Описание механики боя: 1)Есть зоны атаки и зоны защиты. Игрок каждый ход выбирает одну точку для атаки и две точки для защиты (лучше оставить уточняющее описание по этому поводу). Пока игрок не выберет правильное количество точек, игра не позволяет ему атаковать (в демо, например, кнопка активна только если выбрать как надо). 2)После нажатия кнопки происходит обмен ударами. 3)Каждый монстр также имеет свои настройки зон атаки и защиты (в демо есть 3 противника, и каждый из них имеет разные возможности: например, паук бьёт в две точки, а блокирует одну; тролль бьёт в одну точку, но блокирует три). При создании противников нужно это учесть. 4)Куда именно бьёт и что блокирует противник, выбираем случайно. Например, если паук бьёт в две зоны, то каждый ход это две случайные точки, но они не должны совпадать (нельзя, чтобы он бил два раза в ноги, или чтобы тролль трижды блокировал голову — в этом нет смысла). 5)После этого сравниваем, кто куда ударил и кто что блокировал. В случае несовпадений наносим или получаем урон. Например, если игрок бил в голову, а противник блокировал голову — урон не наносится, и наоборот. 6)После обмена ударами подводятся итоги и у обоих участников боя отнимается здоровье.",
            "max": 15
        },
        {
            "type": "subtask",
            "text": "Реализована механика критических ударов. Согласно данной механике, игрок и противник имеют шанс нанести критический урон. В этом случае, если удар не был заблокирован, противник получает дополнительный урон (в демо коэффициент урона 1.5 от обычного). А если удар был заблокирован, блок пробивается и также наносится критический урон.",
            "max": 5
        },
        {
            "type": "subtask",
            "text": "Есть лог боя на каждое действие. Как генерировать лог: каждая атака имеет результат. Например, если игрок атаковал в одну точку, а противник в две, по результатам хода в логе должно появиться 3 записи с результатами. Тексты каждый волен выбирать сам, но обязательно в каждом логе должна содержаться следующая информация: КТО атаковал, КОГО атаковал, КУДА атаковал, СКОЛЬКО нанёс урона. (Капсом выделено то, что обязательно указать.)",
            "max": 50
        },
        {
            "type": "subtask",
            "text": "Реализовано выделение текстовых элементов как в демо (разные стили для ключевой информации)",
            "max": 5
        },
        {
            "type": "title",
            "title": "6. Бонусное задание"
        },
        {
            "type": "subtask",
            "text": "Реализовано полное хранение всех данных, что позволяет при перезагрузке страницы не только продолжать играть своим персонажем, но также сохраняются результаты боёв и полное состояние боя, который был в процессе",
            "max": 20
        },
        {
            "type": "title",
            "title": "ШТРАФ"
        },
        {
            "type": "subtask",
            "text": "Бои заканчиваются за один ход - штраф 20 баллов. Выполнено полностью - бои заканчиваются за один ход.",
            "max": -20
        }
    ]
}