{
  "taskName": "Online-Store",
  "github": "https://github.com/rolling-scopes-school/tasks/tree/master/tasks/online-store-team",
  "criteria": [
    {
      "type": "title",
      "title": "Cтраница товаров с фильтрами +120"
    },
    {
      "type": "subtask",
      "text": "Присутствуют два блока фильтров, по категории и брэнду/названию, где реализован список с возможностью выбрать конкретную категорию/брэнд. +5 за каждый блок",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Присутствуют два блока фильтров с ползунками (dual-slider), по диапазонам цены и наличию на складе. Вы можете заменить наличие на складе на другое свойство товара выбранной Вами тематики. +5 за каждый блок",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Изменение любых фильтров должно добавлять в query-параметры соответствующие данные, для того, чтобы при перезагрузке страницы восстанавливалось текущее состояние страницы с примененными фильтрами",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При применении любого фильтра, должны динамически пересчитываться все фильтры и меняться состояние элементов в них. Текстовый поиск также относится к фильтрам. Например, при выборе определенной категории товара, в других фильтрах должно пересчитываться количество найденных товаров с указанием сколько найдено при такой конфигурации фильтров, а также сколько доступно без учета всех применённых фильтров. В случае с dual-slider должен меняться их состояние-диапазон",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Присутствует возможность сортировки продуктов минимум по 2 критериям, например по цене и рейтингу (от наименьшего к большему и наоборот)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Данные сортировки (если применялась) должны быть добавлены в query-параметр адресной строки. При копировании ссылки и открытии в новом окне/перезагрузке страницы, сортировка должна применяться к найденным продуктам",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "При открытии в новом окне ссылки, которая содержит query-параметр сортировки, блок сортировки должен менять состояние, которое указывает, какая сортировка выбрана",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Присутствует input для поиска-фильтрации продуктов по любым данным. Например, поиск должен работать по всем полям продукта (название, описание, цена, кол-во на складе и т.д.) за исключением не информативных полей (id, url картинки и тд.)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "input для поиска-фильтрации продуктов работает одновременно с другими фильтрами",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Данные о результате поиска добавляются в query-параметры и при перезагрузке страницы восстанавливают состояние текущего поиска. Input также восстанавливает состояние и содержит поисковый текст",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализована возможность переключения вида найденных товаров. Например списком / блоком карточек и т.д. Не менее двух вариантов",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Режим вида товаров добавляется в query-параметры. При перезагрузке страницы восстанавливается состояние текущего вида. Выбранный режим вида выделяется",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Все примененные фильтра, сортировка, вид отображения продуктов, текстовый поиск содержаться в query-параметрах и при перезагрузке страницы восстанавливают её состояние",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Реализована кнопка сброса всех фильтров",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "Реализована кнопка копирования в буфер памяти текущего поиска, то есть адресную строку",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "кнопка копирования текущего поиска меняет состояние при копировании (как Вы это реализуете - решать Вам, можете сделать как в демо)",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "После применение фильтров отображается кол-во найденных товаров",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "В случае, если товаров не нашлось, информация об этом дополнительно выводится в блоке товаров",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Карточка товара содержит кнопку добавления в корзину. Состояние кнопки меняется при добавлении/удалении, а также восстанавливается если товар был добавлен на других страницах",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Должна быть возможность перехода на страницу с описанием товара. Как это реализовать - решать вам. Например, это может быть кнопка, клик по карточке товара и т.д.",
      "max": 5
    },
    {
      "type": "title",
      "title": "Страница корзины выбранных товаров +60"
    },
    {
      "type": "subtask",
      "text": "Продукты выводятся списком, у каждого продукта присутствуют полные данные (имя, категория, цена и т.д.) и блок для управления кол-вом данного товара",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "У каждого товара есть кнопка увеличения его кол-ва в корзине. При увеличении кол-ва, также изменяется состояние кол-ва и общей цены в Header-e и на странице корзины товаров. А также увеличивается общая сумма этого товара у него в списке. При этом, нельзя добавить товара больше, чем есть на складе. Информация о наличии на складе также должна выводиться",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "У каждого товара есть кнопка уменьшения его кол-ва в корзине. Если при уменьшении кол-ва товара его значения становится менее 1, то товар автоматический удаляется из корзины и текущей страницы. Также изменяется состояние кол-ва и общей цены в Header-e и на странице корзины товаров",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Добавлена пагинация с выбором кол-ва товара на одной странице. При изменении кол-ва товаров на странице, автоматически пересчитывается кол-во страниц для переключения. Нельзя переключиться на несуществующую страницу. Также, при удалении товара, пагинация также должна пересчитываться в случае, если после удаления страниц стало меньше, чем та, на которой находился пользователь. Например, выбран лимит 3 товара на странице, всего в корзине 4 товара, соответственно имеем 2 страницы и если пользователь, находясь на второй странице(где есть 1 товар) удаляет его, то автоматический должна переключаться страница на 1 назад. Данные также добавляются в query-параметры, а состояние текущей выбранной страницы и лимита товаров на ней восстанавливается при перезагрузке страницы",
      "max": 8
    },
    {
      "type": "subtask",
      "text": "Если товаров в корзине нет, то все блоки страницы скрываются и вместо них выводится соответствующее сообщение",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Товар на каждой странице имеет порядковый номер с учетом того, сколько товаров есть до него на предыдущих страницах",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Данные о добавленных продуктах хранятся в localStorage и при перезагрузке страницы восстанавливаются",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Добавление и сохранение данных в localStorage происходит также и с других страниц приложения",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализовано поле ввода промокодов. При этом, если промокод найден во время ввода, то должна быть возможность добавления промокода в список примененных. При добавлении каждого промокода, зачеркивается старая итоговая цена на странице корзины(итоговая цена к оплате за все товары) и отображается новая(например под ней), с учетом скидки промокода. Если промокодов более одного, то суммируется их общая скидка и применяется к итоговой цене. Например, было применено 2 промокода, каждый из которых даёт 10% скидки. Суммируем и получаем скидку в размере 20%, затем применяем её к цене, которая образовалась до применения всех промокодов. Кол-во примененных промокодов не ограничено. Кроме того, должна быть возможность удаления промокода из списка примененных. Итоговая цена при этом также пересчитывается",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализован блок примененных промокодов, где указаны все примененные промокоды и размер скидки, которые они дают, при этом цена до применения всех промокодов должна быть перечеркнута, и добавлена новая цена, с учетом скидок всех промокодов",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализована кнопка открытия модального окна оформления покупки. При клике на кнопку открывается модальное окно для оформления заказа",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализован блок с общей суммой и кол-вом всех выбранных товаров. Он отображает сумму и кол-во всех товаров и реагирует на применение промокодов (дополнительно указывается новая цена после применения промокодов)",
      "max": 5
    },
    {
      "type": "title",
      "title": "Модальное окно оформления(покупки) выбранных товаров +50"
    },
    {
      "type": "subtask",
      "text": "Добавлено поле \"Имя и Фамилия\". Валидация: содержит не менее двух слов, длина каждого не менее 3 символов",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Добавлено поле \"Номер телефона\". Валидация: должно начинаться с '+', содержать только цифры и быть не короче 9 цифр",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Добавлено поле \"Адрес доставки\". Валидация: содержит не менее трех слов, длина каждого не менее 5 символов",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Добавлено поле \"E-mail\". Валидация: проверяется, является ли введенный текст электронной почтой",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализован ввод номер карты. Валидация: кол-во введенных цифр должно быть ровно 16, допускается ввод только цифр",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализована автоматическая смена логотипа платежной системы. Например, если номер карты начинает с 4, устанавливается логотип Visa, если 5 - MasterCard. Реализовать не менее 3 платежных систем",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализован блок ввода срока действия карты. Валидация: допускается ввод только цифр, месяц не может быть больше 12, длина поля должна быть равна 4. Например 12/25. Разделитель не учитывается и добавляется автоматически",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализован блок ввод CVV кода. Валидация: длина 3 символа, допускается ввод только цифр",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "При клике на кнопку submit/confirm проверяются все поля на валидность, если у поля есть ошибки валидации, то рядом с этим полем выводится сообщение с ошибкой",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "При успешном прохождении валидации всех полей и нажатии на кнопку, выводится сообщение, что заказ оформлен. Затем, спустя 3-5 секунд происходит редирект на главную страницу магазина. Корзина при этом очищается",
      "max": 5
    },
    {
      "type": "title",
      "title": "Страница с описанием товара +40"
    },
    {
      "type": "subtask",
      "text": "Присутствуют \"хлебные крошки\", указывающие на путь товара относительно корня сайта, например STORE > LAPTOPS > APPLE > MACBOOK PRO",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Реализован блок с фотографиями товара, которые можно увеличивать при клике/наведении. Фотографии не должны содержать дубликаты/повторы",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Реализован блок с полными данными товара (название, категория, описание, цена и т.д.)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Присутствует кнопка добавления товара в корзину. Состояние кнопки зависит от того, есть ли товар в корзине. Например, товар мог быть добавлен в корзину на текущей странице или странице товаров и соответственно текст кнопки должен это отображать",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Присутствует кнопка быстрой покупки товара. При клике, если товара нет в корзине, происходит автоматическое добавление в корзину и переход на страницу корзины, с уже открытым модальным окном. Если товар уже был в корзине, повторное добавление не требуется",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Страница конкретного товара имеет свой маршрут. Например, страница с товаром MacBook Pro открывается вне зависимости от того, посещались ли другие страницы приложения",
      "max": 10
    },
    {
      "type": "title",
      "title": "Header, содержащий кол-во добавленных в корзину товаров и общую сумму покупок +20"
    },
    {
      "type": "subtask",
      "text": "Присутствует корзина с количеством выбранных товаров",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Количество выбранных товаров динамически изменяется при добавлении/удалении товара на всех страницах (корзина, карточка товара, поиск товаров). А также включает кол-во одного вида товара, который может быть добавлен больше 1шт на странице корзины",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Присутствует корзина с суммой выбранных товаров",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "Сумма выбранных товаров динамически изменяется при добавлении/удалении товара на всех страницах (корзина, карточка товара, поиск товаров). А также включает кол-во одного вида товара, который может быть добавлен больше 1шт на странице корзины",
      "max": 5
    },
    {
      "type": "title",
      "title": "Страница 404 +10"
    },
    {
      "type": "subtask",
      "text": "При переходе по несуществующему адресу открывается страница 404. Например, 'https://your-deploy.com/gfdgd' в случе если страницы с названием 'gfdgd' не существует",
      "max": 6
    },
    {
      "type": "subtask",
      "text": "При появлении необрабатываемых(в вашем коде) query-параметров, страница не открывается. Например, 'https://your-deploy.com/?rgfg=dfoh'. Если в вашем случае параметр '?rgfg=dfoh' некорректен, то он не должен направлять на страницу 404",
      "max": 4
    },
    {
      "type": "penalty",
      "text": "приложение написано без использования TypeScript",
      "max": -300
    },
    {
      "type": "penalty",
      "text": "если вам на cross-check попалась работа которая выполнялась не командой из 2-х человек, вам необходимо заполнить форму ( https://docs.google.com/forms/d/e/1FAIpQLSel2rRvRBcPW9w7Eiq_Wnc0v6LVxv-wwE72l10Q8VRZhmorQQ/closedform ), администраторы курса в таком случае могут применить штраф до 300 баллов",
      "max": -300
    }
  ]
}