{
  "taskName": "photo-filter",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/js30/js30-5.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nВсе сомнения трактуются на пользу студента\nЕсли в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nИспользование для отображения изображения канваса и, соответственно, использование вместо css-фильтров фильтров канваса, ошибкой не является"
    },
    {
      "type": "subtask",
      "text": "на странице отображается изображение и настройки css-фильтров `blur`, `invert`, `saturate`, `sepia`, `hue rotate` в виде ползунков. Напротив каждого ползунка есть поле, в котором отображается значение соответствующего css-фильтра. Дополнительные фильтры можно добавить по своему усмотрению. Стартовое изображение загружается из файлов самого приложения. Его соответствие времени суток не требуется",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при перемещении ползунка в поле напротив него изменяется значение css-фильтра",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при перемещении ползунка меняется внешний вид изображения в соответствии с изменением значения соответствующего css-фильтра",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке `Reset`, сбрасываются значения всех css-фильтров. При этом возвращаются к исходному состоянию положение ползунков, значения в соответствующих им полях и внешний вид изображения",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при нажатии на кнопку `Next picture` загружается изображение из папки с картинками, расположенной на Github. Если в приложении установлены пользовательские значения фильтров, при перелистовании изображений они сохраняются",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при нажатии на кнопку `Next picture` изображения перелистываются по кругу: после последнего двадцатого изображения снова загружается первое",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "изображения должны соответствовать текущему времнени суток\n- с 6:00 до 11:59 - morning\n- с 12:00 до 17:59 - day\n- с 18:00 до 23:59 - evening\n- с 00:00 до 5:59 - night\n(как проверить: откройте приложение и убедитесь, что при кликах на кнопку `Next picture` открываются изображения, соответствующие текущему времени суток. Время суток определяется по системному времени пользователя. Перевод часов не проверяется и не оценивается.)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по кнопке `Load picture` открывается окно выбора файлов на компьютере, выбранное изображение, вписывается в предназначенное для него окно занимая всю возможную площадь. Пропорции изображения при этом не искажаются. Если в приложении установлены пользовательские значения фильтров, при загрузке нового изображения они сохраняются. Одно и то же изображение можно загружать повторно (как проверить: загрузите изображение, нажмите на `Next picture`, чтобы картинка сменилась, снова загрузите то же самое изображение с компьютера. Формат изображения, которое использует проверяющий при проверке данного пункта, может быть jpg, jpeg, png, неанимированный gif)",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по `Save picture` изображение скачивается на компьютер, в исходном размере (в рх) в формате `.png` с сохранением прозрачности, если она была в исходном изображении. Скачать можно стартовое изображение, изображение полученное при перелистывании кнопкой `Next picture`, изображение загруженное с компьютера",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "изображение скачивается на компьютер вместе с добавленными фильтрами. Внешний вид скачанного изображения совпадает с внешним видом изображения, которое редактировалось на странице приложения",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "особое внимание обратите на фильтр `blur` (как проверить данный фильтр: загрузите очень большое или очень маленькое изображение, изображение вытянутое в ширину или в высоту, измените значение фильтра `blur`, сравните размытие изображения, загруженного на компьютер и открытого в графическом редакторе, с размытием этого же изображения в приложении). Полупрозрачные края картинки при использовании данного фильтра - норма, так и должно быть. Если заметили отличия, используйте для сравнения демо приложения, в нём фильтр `blur` работает корректно",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "есть кнопка `Fullscreen` при клике по которой можно развернуть приложение во весь экран. Повторный клик по кнопке `Fullscreen` или клик по клавише `Esc` клавиатуры выводит приложение из полноэкранного режима. В зависимости от того, находится приложение в обычном или полноэкранном режиме, меняется иконка на кнопке. Взаимодействие кнопки `Fullscreen` с клавишей `F11` не требуется и не проверяется",
      "max": 5
    },
    {
      "type": "penalty",
      "text": "обоснованные подозрение на списывание (js-код работы полностью повторяет код источника в интернете), работы с минимизированным или обфусцированным js-кодом, работы с использованием jQuery или других js-библиотек, работы с крайне низким качеством оформления - 0 баллов за кросс-чек. Ссылки на такие работы необходимо отправить модератору курса",
      "max": -60
    },
    {
      "type": "title",
      "title": "ссылки на лучшие работы с качественным оригинальным оформлением или реализованным дополнительным функционалом, добавьте, пожалуйста, в эту форму https://forms.gle/QELfqGDNCaPLHMzo9"
    }
  ]
}
