{
  "taskName": "X Check App",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/xcheck/xcheck.md",
  "information": "",
  "criteria": [
    {
      "type": "title",
      "title": "Базовая функциональность +140"
    },
    {
      "type": "subtask",
      "text": "Упрощённая страница/окно авторизации",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Страница со списком задач (tasks)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Форма (на отдельной странице или в окне) создания и редактирования задачи",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "Страница со списком запросов на проверку (review requests)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Список запросов на проверку можно сортировать и фильтровать по заданию и выполнившему студенту.",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Форма создания запроса на проверку",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Форма проверки и самопроверки задания",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "Страница со списком оценок работ (reviews)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Список оценок можно сортировать по всем полям/колонкам, где сортировка применима",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Список оценок можно фильтровать по заданию, выполнившему студенту и проверяющему",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Страница или окно с деталями оценки одного проверяющего",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Главная страница со ссылками на остальные доступные страницы ИЛИ всегда видимое меню для навигации",
      "max": 10
    },
    {
      "type": "title",
      "title": "Дополнительные возможности при создании задания +90"
    },
    {
      "type": "subtask",
      "text": "Пометить пункт как штраф ИЛИ возможность указать минимальный балл меньше 0",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Пометить пункт как проверяемый только ментором (скрывать при кросс-чеке), или более сложная система ролей при проверке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Объединение требований в категории (basic scope, advanced, etc)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Импорт пунктов и категорий в формате RSS Checklis",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Импорт пунктов и категорий в markdown формате, в котором описано большинство задач RSS",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "Экспорт и импорт задания в собственном JSON формате. Побочный эффект - задание легко скопировать, оставив оригинальное без изменений",
      "max": 20
    },
    {
      "type": "title",
      "title": "Дополнительные возможности при проверке задания +40"
    },
    {
      "type": "subtask",
      "text": "Кнопки для быстрой оценки (не выполнено - 0 баллов, выполнено частично - 50%, выполнено полностью - 100%), но остаётся возможность указать любое промежуточное значение",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Дать возможность проверяющему добавить ещё один пункт со штрафными или поощрительными баллами. Способы реализации могут быть различными, например можно просто дать возможность указывать не только максимальный балл за требование, но и минимальный меньше ноля",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Сделать поле комментария обязательным, если оценка не совпадает с самопроверкой",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Промежуточное состояние проверки (и самопроверки тоже) можно сохранить, не публикуя её",
      "max": 10
    },
    {
      "type": "title",
      "title": "Дополнительные возможности после проверки задания +50"
    },
    {
      "type": "subtask",
      "text": "Возможность оставить обратную связь проверяющему - поблагодарить или пожаловаться",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Возможность оспорить оценку по каждому пункту",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "Принять решение по оспариваемому пункту может не только проверяющий, но и пользователь со специальной ролью",
      "max": 10
    },
    {
      "type": "title",
      "title": "Кросс-чек +50"
    },
    {
      "type": "subtask",
      "text": "Страница со списком кросс-чек сессий. Автор заданий (или другая роль на ваше усмотрение) может создавать и редактировать сессии",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "Студенты могут создавать запросы на проверку в рамках конкретной кросс-чек сессии",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Автор задания может остановить сбор запросов на проверку в рамках кросс-чек сессии и случайным образом распределить проверяющих",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Автор задания может завершить кросс-чек сессию, после чего студент может посмотреть свою итоговую оценку",
      "max": 10
    },
    {
      "type": "title",
      "title": "Дополнительная функциональность +100"
    },
    {
      "type": "subtask",
      "text": "Каждое действие, меняющее данные, доступно только при наличии у пользователя соответствующей роли. Набор ролей можно взять из примера или придумать свои. Ограничения должны быть описаны в README. Если выбор роли недоступен при логине или регистрации, тогда в исходной базе (db.json) должны быть тестовые пользователи с каждой из ролей, а их логины и пароли должны быть в README.",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "Полноценная авторизация через GitHub OAuth. Для удобства проверки выбор ролей лучше оставить при логине",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "В исходной базе (db.json) есть примеры сущностей каждого типа",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "В исходной базе (db.json) воспроизведено задание xcheck и создан запрос на его оценку",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Дополнительные полезные возможности, не описанные в требованиях к заданию. Для оценки должны обязательно быть описаны в README",
      "max": 30
    },
    {
      "type": "title",
      "title": "Качество кода +130"
    },
    {
      "type": "subtask",
      "text": "README файл в репозитории с описанием используемых технологий, инструкцией для начала разработки и для деплоя продакшн версии.",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "Написаны юнит-тесты, code coverage > 50%. Способ получения coverage report описан в README.",
      "max": 50
    },
    {
      "type": "subtask",
      "text": "По названиям юнит тестов понятно, что они тестируют. Тесты не просто вызывают код, но и делают осмысленные ассерты. до +30, если code coverage меньше 50%, максимальная оценка снижается пропорционально (при 25% максимум +15 баллов)",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "Использован eslint preset (не обязательно airbnb) и нет предупреждений и ошибок",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "В репозитории есть \"следы\" активной командной работы - комментарии в пулл реквестах",
      "max": 10
    }
  ]
}
