{
  "taskName": "RS Селекторы",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/rs-css.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nВсе сомнения трактуются на пользу студента\nЕсли в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Если приложение работает некорректно, необходимо очистить Local storage. Такое возможно, если обе работы сохраняют в Local storage данные с одинаковы именем, но с разными свойствами\nРабота приложения проверяется в браузере Google Chrome последней версии\nАдаптивность проверяем в Toggle device toolbar браузера Google Chrome\nПриложение может быть как на английском, так и на русском языке"
    },
    {
      "type": "title",
      "title": "Basic scope +70"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI. Внешний вид приложения соответствует приложению-прототипу или является его улучшенной версией. Выполняются требования к оформлению приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "используются собственные оригинальные интересные разнообразные задания на нахождение css-селекторов. Количество заданий не меньше десяти",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "выполнен блок с примером вёрстки. Элементы, для которых необходимо написать css-селектор, выделены при помощи анимации",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "выполнен блок с окном для ввода кода пользователем. В окне для ввода кода можно напечатать css-селектор",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "выполнен блок с кодом вёрстки, в котором отображается код вёрстки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "выполнен блок со списком уровней игры. У пользователя есть возможность переходить к определённому уровню кликая по его номеру",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "текущий уровень подсвечен. При перезагрузке приложение открывается на этом же уровне",
      "max": 10
    },
    {
      "type": "title",
      "title": "Advanced scope +80"
    },
    {
      "type": "subtask",
      "text": "подсветка html и css-кода в окне для ввода кода пользователем и блоке с кодом вёрстки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при наведении курсора на строку в блоке с кодом, отвечающий этой строке элемент в блоке с примером вёрстки подсвечивается. Рядом с элементом отображается его html-код",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при наведении курсора на элемент в блоке с вёрсткой, подсвечивается соответствующий ему фрагмент в блоке с кодом. Рядом с элементом отображается его html-код",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "введённые пользователем селекторы можно отправить на проверку как кликом по кнопке Enter в окне для ввода кода, так и нажатием клавиши Enter на клавиатуре. Отправленные на проверку селекторы проверяются на соответствие требованиям задания",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "проверку проходят любые селекторы, отвечающие всем выделенным элементам",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если пользователь ввёл правильный css-селектор, отвечающий всем выделенным элементам, отображается соответствующая анимация, и автоматически открывается следующий уровень игры, или выводится уведомление о победе, если уровень последний. Если пользователь ответил неправильно, отображается соответствующая анимация",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "в приложении есть кнопка Help для тех случаев, когда пользователь не сумеет угадать нужный селектор. Клик по кнопке Help выводит нужный селектор в окне для ввода кода. Селектор выводится с эффектом печати текста (плавное появление текста по буквам)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "возле каждого уровня игры отображается, выполнен он, или нет, или уровень выполнен с использованием подсказки. Есть кнопка, позволяющая сбросить прогресс и начать прохождение игры заново",
      "max": 10
    },
    {
      "type": "title",
      "title": "Hacker scope +20"
    },
    {
      "type": "subtask",
      "text": "используется собственное оформление игры и примеров вёрстки, по качеству выполнения не уступающее приложению-прототипу",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "используются собственные оригинальные интересные разнообразные задания на нахождение css-селекторов. Задания расположены в порядке увеличения сложности и могут использоваться потенциальными пользователями в качестве тренажёра для изучения селекторов. Количество заданий не меньше двадцати",
      "max": 10
    },
    {
      "type": "title",
      "title": "Ссылки на лучшие работы добавьте, пожалуйста, в эту форму https://forms.gle/TVWGm7N6oaRSnrVW6"
    }
  ]
}
