{
  "taskName": "RS Lang",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/rslang/rslang.md",
  "criteria": [
    {
      "type": "title",
      "title": "Обратите внимание"
    },
    {
      "type": "title",
      "title": "1. При проверке работ надо обязательно создавать нового пользователя для каждой из проверяемых работ"
    },
    {
      "type": "title",
      "title": "2. Баллы за мини-игры (50-100-120) нужно считать вручную, автоматический подсчёт баллов для игр работает неверно"
    },
    {
      "type": "title",
      "title": "Изучение новых слов +110"
    },
    {
      "type": "subtask",
      "text": "в настройках приложения пользователь может указать количество новых слов, которые планирует выучивать за день, а также максимальное количество карточек на день. Это число не будет превышено, даже если ещё есть карточки, ожидающие изучения. Когда дневная норма выполнена, об этом выводится уведомление",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "в настройках приложения пользователь может указать какая информация выводится на карточках со словами, выбирая из следующих пунктов: перевод слова, предложение с объяснением значения слова, предложение с примером использования изучаемого слова. Хотя бы один пункт должен быть отмечен. Также в настройках можно выбирать показывать ли на карточке транскрипцию слова, картинку-ассоциацию к изучаемому слову",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "когда открывается карточка с новым словом, курсор находится в поле ввода, ширина поля ввода соответствует длине изучаемого слова. Когда слово набрано, ввести его можно нажав на клавишу Enter или нажав на кнопку Дальше (или аналогичную)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после ввода слова звучит его произношение на английском языке, а также произношение предложений с объяснением слова и с примером использования слова, если они выбраны в настройках и отображаются на странице. Воспроизведение звука можно отключать и включать на странице приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после ввода слова под ним самим, а также под текстом предложений с объяснением слова и с примером использования слова, если они выбраны в настройках и отображаются на странице, появляется их перевод. Перевод изучаемого слова и перевод предложений можно отключать и включать на странице приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если слово набрано без ошибок, происходит переход к следующей карточке с новым словом. Если слово было набрано с ошибками, в окне для ввода слова отображается изучаемое слово, в котором совпадающие буквы подсвечиваются зелёным, а несовпадающие красным или оранжевым цветом, в зависимости от количества ошибок. Затем изучаемое слово становится полупрозрачным, когда пользователь снова начинает вводить ответ, изучаемое слово исчезает с поля ввода",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "переходить к следующей карточке можно и не набирая изучаемое слово в поле ввода, просто нажимая на кнопку Показать ответ под изучаемым словом. Наличие этой кнопки на странице регулируется настройками приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "слово можно исключить из изучения, нажав на кнопку Удалить. Наличие этой кнопки на странице регулируется настройками приложения. Удалённые слова сохраняются на отдельной вкладке на странице Словарь, там их можно просмотреть. Возле каждого удалённого слова есть кнопка Восстановить, которая возвращает его в перечень изучаемых слов",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "слово можно поместить в группу Сложные. Наличие на странице кнопки, помещающей слово в группу Сложные регулируется настройками приложения. Помещённые в эту группу слова можно изучать отдельно от остальных.  Сложные слова сохраняются на отдельной вкладке на странице Словарь. Возле каждого сложного слова есть кнопка Восстановить, которая возвращает его в общий перечень изучаемых слов",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице приложения присутствует шкала на которой отображается общее количество карточек со словами на сегодня и количество уже изученных карточек. Цветом на шкале отображается прогресс изучения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "общее количество карточек на сегодня состоит из карточек с новыми словами и карточек со словами, которые нужно повторить. У пользователя есть возможность изучать их не вперемешку, а выбрать для изучения только новые слова, или только те слова, которые нужно повторить",
      "max": 10
    },
    {
      "type": "title",
      "title": "Статистика +40"
    },
    {
      "type": "subtask",
      "text": "после выполнения дневной нормы выводится краткосрочная статистика, в которой указывается количество пройденных карточек со словами, процент правильных ответов, количество новых слов, самая длинная серия правильных ответов",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "долгосрочная статистика представляет собой график, на котором отображается общее количество изученных слов за весь период и могут выводиться другие данные, отображающие прогресс обучения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "для отображения графика использован canvas",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на графике при наведении отображаются данные за каждый день изучения - дата и количество изученных слов, либо график полностью повторяет график приложения lingvist: при перемещении ползунка внизу изменяется закрашенная область графика, отображая зависимость овладения лексикой языка от количества выученных слов",
      "max": 10
    },
    {
      "type": "title",
      "title": "Методика интервального повторения +60"
    },
    {
      "type": "subtask",
      "text": "под каждым изучаемым словом, после того, как оно угадано, появляются кнопки Снова, Трудно, Хорошо, Легко или аналогичные, при помощи которых пользователь может указать индивидуальную сложность изучаемого слова. Наличие этих кнопок на странице регулируется настройками приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если при изучении слова была допущена ошибка, или пользователь нажал на кнопку Снова, карточка с этим словом вновь появится для изучения на текущей тренировке. Если в изучаемом слове была допущена ошибка в ходе мини-игры, карточка с ним появится на ближайшей тренировке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на промо-странице приложения присутствует описание набора правил для определения интервала, через который будет вновь показана карточка с изучаемым словом. Правила интервального повторения выглядят разумными и логичными, в ходе проверки не выявлено расхождения работы приложения с указанными правилами",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице Словарь есть список изучаемых слов с примером звучания слова, переводом, а также примерами предложений с объяснением значения слова, примером использования слова, транскрипцией, картинкой-ассоциацией, если последние указаны в настройках",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице Словарь возле каждого изучаемого слова указывается прогресс изучения, сколько раз это слово повторялось, когда повторялось в последний раз, и когда будет повторяться снова",
      "max": 20
    },
    {
      "type": "title",
      "title": "Мини-игры +50 или +100 или +120 баллов"
    },
    {
      "type": "subtask",
      "text": "SpeakIt",
      "max": 120
    },
    {
      "type": "subtask",
      "text": "English-puzzle",
      "max": 120
    },
    {
      "type": "subtask",
      "text": "Саванна",
      "max": 120
    },
    {
      "type": "subtask",
      "text": "Аудиовызов",
      "max": 120
    },
    {
      "type": "subtask",
      "text": "Спринт",
      "max": 120
    },
    {
      "type": "title",
      "title": "Своя игра +120"
    },
    {
      "type": "subtask",
      "text": "качественный интересный оригинальный дизайн. Есть стартовый экран",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "игра интересная, полезная, увлекательная, не является клоном предыдущих игр",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "оригинальная идея, сложный механизм игры, высокое качество его реализации",
      "max": 40
    },
    {
      "type": "subtask",
      "text": "использованы новые подходы, реализованы новые возможности, которых не было в предыдущих играх",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "ведётся краткосрочная и долгосрочная статистика мини-игры. Для хранения статистики используется бекэнд",
      "max": 10
    },
    {
      "type": "title",
      "title": "Авторизация +20"
    },
    {
      "type": "subtask",
      "text": "реализована авторизация и регистрация нового пользователя. Основная часть приложения доступна только после успешной авторизации. При перезагрузке приложения данные о пользователе сохраняются",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "реализован logout, который прекращает работу приложения, делает пользователя анонимным и перенаправляет его на страницу авторизации без доступа к основному приложению",
      "max": 10
    },
    {
      "type": "title",
      "title": "Промо-страница приложения +20"
    },
    {
      "type": "subtask",
      "text": "красочное, интересное, яркое, привлекательное описание приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "качественное видео, демонстрирующее работу приложения",
      "max": 10
    },
    {
      "type": "title",
      "title": "Страница 'О команде' +10"
    },
    {
      "type": "subtask",
      "text": "представляет каждого участника команды, описывает его вклад в разработку приложения",
      "max": 10
    },
    {
      "type": "title",
      "title": "Дополнительный функционал +20"
    },
    {
      "type": "subtask",
      "text": "оригинальная идея, значительный вклад в улучшение качества приложения, заметная полезность",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "сложность реализации, качество выполнения",
      "max": 10
    },
    {
      "type": "title",
      "title": "Штрафы"
    },
    {
      "type": "penalty",
      "text": "ошибки в работе приложения (неправильный подсчёт баллов и т д) -10 баллов за каждую ошибку, но не больше общего количества баллов за выполнение данного пункта задания",
      "max": -10
    },
    {
      "type": "penalty",
      "text": "проблемы с отображением страниц, проблемы с адаптивностью -10 баллов за каждую страницу, на которой присутствуют указанные проблемы, но не больше общего количества баллов за выполнение данного пункта задания",
      "max": -10
    },
    {
      "type": "penalty",
      "text": "проблемы с оформлением приложения, несовпадение стилей, плохой некачественный дизайн -10 баллов за каждую страницу, на которой присутствуют указанные проблемы, но не больше общего количества баллов за выполнение данного пункта задания",
      "max": -10
    }
  ]
}
