{
  "taskName": "RSS English for Kids",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/rslang/english-for-kids.md",
  "information": "",
  "criteria": [
    {
      "type": "title",
      "title": "Basic scope +50/+80"
    },
    {
      "type": "subtask",
      "text": "Вёрстка, дизайн, UI главной страницы приложения: присутствуют все указанные в задании элементы как на мобильной, так и на десктопной версии, выполнены все описанные требования к оформлению приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Вёрстка, дизайн, UI выезжающего меню: <br/> выполнены все описанные требования к оформлению приложения; ссылки в меню рабочие и ведут на страницы с категориями слов; ссылка на текущую страницу внешне отличается от остальных; выезжающее меню присутствует на всех страницах приложения; плавная анимация выезжающего меню; меню закрывается кликом по крестику, кликом по ссылке в меню, кликом в любом месте приложения, кроме самого меню",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Вёрстка, дизайн, UI страницы категории: присутствуют все указанные в задании элементы как на мобильной, так и на десктопной версии, выполнены все описанные требования к оформлению приложения",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим тренировки: при клике по карточке звучит произношение слова на английском языке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим тренировки: на каждой карточке есть кнопка, при клике по которой карточка поворачивается, на обратной стороне указан перевод слова. Когда курсор мыши перемещается за границы карточки, она автоматически поворачивается на лицевую сторону",
      "max": 10
    },
    {
      "type": "title",
      "title": "Advanced scope +80"
    },
    {
      "type": "subtask",
      "text": "Режим игры: кликом по переключателю Train/Play включается режим игры. В режиме игры указанные выше возможности режима тренировки отключаются, кнопка, при клике по которой карточка переворачивалась, и текст на карточке скрываются. Появляется кнопка \"Start game\". Размер карточки не изменяется. На карточке остаётся только изображение, которое занимает всю её площадь (если это не противоречит вашему дизайну)",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: после клика по кнопке \"Start game\" звучит английское произношение рандомного слова из тех, что находятся на странице. Для каждой страницы, и для каждой игры рандомные слова генерируются по-новой",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: после первого клика по кнопке \"Start game\" надпись на ней меняется на иконку \"Repeat\", меняется внешний вид кнопки. При клике по кнопке \"Repeat\" произношение слова звучит ещё раз",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: если пользователь кликнул по активной карточке с неправильным ответом, раздаётся звуковой сигнал \"error\"",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: если пользователь кликнул по активной карточке с правильным ответом, раздаётся звуковой сигнал \"correct\" и после него звучит произношение рандомного слова из тех, которые ещё не звучали",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: карточка с угаданным словом становится неактивной, при этом изменяется её внешний вид. Клики по неактивной карточке звуковыми эффектами не сопровождаются, на счёт игры не влияют",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: после начала игры каждый клик по активной карточке является правильным или неправильным ответом. Эти ответы отображаются в виде звёздочек (или других символов) разного цвета в шкале с рейтингом, которая появляется в режиме игры. Если звёздочек слишком много и шкала заполнена ими полностью, предыдущие звёздочки скрываются, а новые продолжают добавляться",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Режим игры: когда угаданы все слова в категории, то: - если все слова угаданы правильно, звучит сигнал \"success\", карточки со словами скрываются, на странице отображается радостный смайлик (или другая картинка); - если при угадывании слов были ошибки, звучит сигнал \"failure\", карточки со словами скрываются, на странице отображается грустный смайлик (или другая картинка) и количество допущенных ошибок; - приложение автоматически перенаправляет на главную страницу со списком категорий",
      "max": 10
    },
    {
      "type": "title",
      "title": "Hacker scope +40"
    },
    {
      "type": "subtask",
      "text": "Страница статистики: страница со статистикой содержит перечень всех категорий, всех слов в каждой категории, перевод каждого слова. Минимальная ширина, при которой страница статистики отображается корректно – 320 рх. Не является ошибкой наличие в таблице со статистикой полосы прокрутки",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "возле каждого слова указывается статистика - сколько раз по карточки с данным словом кликали в режиме тренировки, сколько раз данное слово угадывали в режиме игры, сколько ошибок при этом допустили, процент правильных ответов по каждому слову в режиме игры. После перезагрузки приложения статистика сохраняется",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "есть возможность сортировки данных по алфавиту, для числовых значений - по их величине. Сортировка может происходить в прямом и обратном порядке и должна охватывать весь диапазон данных",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице со статистикой размещены кнопки \"Repeat difficult words\" и \"Reset\". Кнопка \"Reset\" обнуляет статистику. При клике по кнопке \"Repeat difficult words\" открывается страница изучения слов с наибольшим процентом ошибок аналогичная странице категории. На странице \"Repeat difficult words\" может размещаться от нуля до восьми слов, в зависимости от того сколько слов угадывалось в режиме игры и при их угадывании были допущены ошибки. После нажатия на кнопку \"Reset\" количество слов на странице \"Repeat difficult words\" равно нулю",
      "max": 10
    },
    {
      "type": "title",
      "title": "Штрафные баллы"
    },
    {
      "type": "penalty",
      "text": "меньше восьми категорий, меньше восьми слов в каждой категории, данные для двух последних категорий скопированы с демо, а не подготовлены самостоятельно",
      "max": -10
    }
  ]
}
