{
  "taskName": "Shelter. Week-3",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/shelter/shelter-part3.md",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие. Проверяются только требования, указанные в критериях. Если какой-то момент в критериях не описан, его не проверяем и не оцениваем."
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии. Все сомнения трактуются в пользу студента. Если сомневаетесь снимать баллы или нет, не снимайте."
    },
    {
      "type": "title",
      "title": "Реализация burger menu на обеих страницах +26"
    },
    {
      "type": "subtask",
      "text": "при ширине страницы меньше 768рх панель навигации скрывается, появляется бургер-иконка",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при нажатии на бургер-иконку, справа плавно появляется адаптивное меню шириной 320px, бургер-иконка плавно поворачивается на 90 градусов",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "высота адаптивного меню занимает всю высоту экрана",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при повторном нажатии на бургер-иконку или на свободное от бургер-меню пространство (оба варианта должны быть реализованы) адаптивное меню плавно скрывается уезжая за правую часть экрана, бургер-иконка плавно поворачивается на 90 градусов обратно",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "бургер-иконка создана при помощи html+css, без использования изображений",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям, сохраняются заданные на первом этапе выполнения задания требования интерактивности элементов меню",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при клике по любой ссылке (интерактивной или неинтерактивной) в меню адаптивное меню плавно скрывается вправо, бургер-иконка поворачивается на 90 градусов обратно",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "расположение и размеры элементов в бургер-меню соответствует макету (центрирование по вертикали и горизонтали элементов меню, расположение иконки). При этом на странице Pets цветовая схема может быть как темная, так и светлая",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "область, свободная от бургер-меню, затемняется",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "страница под бургер-меню не прокручивается",
      "max": 4
    },
    {
      "type": "title",
      "title": "Реализация слайдера-карусели на странице 'Main' +36"
    },
    {
      "type": "subtask",
      "text": "при нажатии на стрелки происходит переход к новому блоку элементов",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "смена блоков происходит с соответствующей анимацией карусели (способ выполнения анимации не проверяется)",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "слайдер бесконечен, т.е. можно бесконечно много нажимать влево или вправо, и каждый раз будет прокрутка в эту сторону с новым набором карточек",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "при переключении влево или вправо прокручивается ровно столько карточек, сколько показывается при текущей ширине экрана (3 для 1280px, 2 для 768px, 1 для 320px)",
      "max": 4
    },
    {
      "type": "title",
      "title": "Каждый новый слайд содержит псевдослучайный набор карточек животных, т.е. формируется из исходных объектов в случайном порядке со следующими условиями:"
    },
    {
      "type": "subtask",
      "text": "в текущем блоке слайда карточки с питомцами не повторяются",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "в следующем блоке нет дублирования карточек с текущим блоком. Например в слайдере из 3 элементов, следующий выезжающий слайд будет содержать 3 (из 8 доступных) новых карточки питомца, таких, каких не было среди 3х карточек на предыдущем уехавшем слайде",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "сохраняется только одно предыдущее состояние. Т.е. при последовательном переходе два раза влево, а потом два раза вправо, мы получим набор карточек, отличный от исходного",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "при каждой перезагрузке страницы формируется новая последовательность карточек",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "генерация наборов карточек происходит на основе 8 объектов с данными о животными",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при изменении ширины экрана (от 1280px до 320px и обратно), слайдер перестраивается и работает без перезагрузки страницы (набор карточек при этом может как изменяться, так и оставаться тем же, скрывая лишнюю или добавляя недостающую, и сохраняя при этом описанные для слайдера требования)",
      "max": 4
    },
    {
      "type": "title",
      "title": "Реализация пагинации на странице 'Pets' +36"
    },
    {
      "type": "subtask",
      "text": "при перезагрузке страницы всегда открывается первая страница пагинации",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при нажатии кнопок '>' или '<' открывается следующая или предыдущая страница пагинации соответственно",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при нажатии кнопок '>>' или '<<' открывается последняя или первая страница пагинации соответственно",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при открытии первой страницы кнопки '<<' и '<' неактивны",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при открытии последней страницы кнопки '>' и '>>' неактивны",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "в кружке по центру указан номер текущей страницы. При переключении страниц номер меняется на актуальный",
      "max": 2
    },
    {
      "type": "title",
      "title": "Каждая страница пагинации содержит псевдослучайный набор питомцев, т.е. формируется из исходных объектов в случайном порядке со следующими условиями:"
    },
    {
      "type": "subtask",
      "text": "при загрузке страницы формируется массив из 48 объектов питомцев. Каждый из 8 питомцев должен встречаться ровно 6 раз",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "при каждой перезагрузке страницы формируется новый массив со случайной последовательностью",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "карточки питомцев не должны повторяться на одной странице",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "при переключении страницы данные меняются (для >1280px меняется порядок карточек, для остальных - меняется набор и порядок карточек)",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "при неизменных размерах области пагинации, в том числе размерах окна браузера, и без перезагрузки страницы, возвращаясь на страницу под определенным номером, контент на ней всегда будет одинаков. Т.е. карточки питомцев будут в том же расположении, что и были до перехода на другие страницы",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "общее количество страниц при ширине экрана 1280px - 6, при 768px - 8, при 320px - 16 страниц",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при изменении ширины экрана (от 1280px до 320px и обратно), пагинация перестраивается и работает без перезагрузки страницы (страница может оставаться той же или переключаться, при этом сформированный массив - общая последовательность карточек - не обновляется, сохраняются все остальные требования к пагинации)",
      "max": 4
    },
    {
      "type": "title",
      "title": "Реализация попап на обеих страницах +12"
    },
    {
      "type": "subtask",
      "text": "попап появляется при нажатии на любое место карточки с описанием конкретного животного",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "часть страницы вне попапа затемняется",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при открытии попапа вертикальный скролл страницы становится неактивным, при закрытии - снова активным",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "при нажатии на область вокруг попапа или на кнопку с крестиком попап закрывается (оба варианта должны быть реализованы), при этом при нажатии на сам попап ничего не происходит",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "кнопка с крестиком интерактивная",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "окно попапа (не считая кнопку с крестиком) центрировано по всем осям, размеры элементов попапа и их расположение совпадают с макетом",
      "max": 2
    },
    {
      "type": "title",
      "title": "Штрафы"
    },
    {
      "type": "penalty",
      "text": "Верстка всего макета или отдельных блоков добавлена картинкой",
      "max": -110
    },
    {
      "type": "penalty",
      "text": "Использованы запрещенные техническими требованиями фреймворки, библиотеки, пакеты, надстройки",
      "max": -110
    },
    {
      "type": "penalty",
      "text": "Для реализации слайдера и (или) пагинации используются сторонние библиотеки или пакеты",
      "max": -110
    }
  ]
}
