{
  "taskName": "song-bird",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/songbird.md",
  "criteria": [
    {
      "type": "title",
      "title": "Допускается:\n-другая тематика приложения (не птицы)\n-использование вместо изображений видео\n-замена названий и описаний птиц другими данными"
    },
    {
      "type": "title",
      "title": "Вёрстка, дизайн, UI: +30"
    },
    {
      "type": "subtask",
      "text": "минимальная ширина, при которой приложение отображается корректно – 320 рх",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "внешний вид приложения полностью повторяет демо или является его улучшенной версией",
      "max": 20
    },
    {
      "type": "title",
      "title": "Аудиоплеер: +30"
    },
    {
      "type": "subtask",
      "text": "есть аудиоплеер",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "аудиоплеер кастомный, такой же, как в демо приложения, может отличаться по цвету",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "у кастомного аудиоплеера есть регулятор громкости звука",
      "max": 10
    },
    {
      "type": "title",
      "title": "Контент +20"
    },
    {
      "type": "subtask",
      "text": "использование заранее подготовленных данных из репозитория с заданием",
      "max": 0
    },
    {
      "type": "subtask",
      "text": "создание и использование собственной коллекции данных, либо использование подходящего API",
      "max": 20
    },
    {
      "type": "title",
      "title": "Header +20"
    },
    {
      "type": "subtask",
      "text": "правильное отображение текущего счета игры",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "индикация текущего вопроса (подсветка категории в header)",
      "max": 10
    },
    {
      "type": "title",
      "title": "Блок с вопросом +20"
    },
    {
      "type": "subtask",
      "text": "подстановка дефолтного изображения и замена названия птицы на символы (***), пока игрок не выберет правильный ответ",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при выборе правильного ответа появляется изображение и название птицы",
      "max": 10
    },
    {
      "type": "title",
      "title": "Блок с вариантами ответов (названия птиц) +30"
    },
    {
      "type": "subtask",
      "text": "цветовая индикация правильного/неправильного ответа в виде индикаторов разного цвета рядом с названием птицы",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "при клике по названию птицы в блоке с описанием птицы отображается информацию о ней",
      "max": 10
    },

    {
      "type": "title",
      "title": "Блок с описанием птицы +30"
    },
    {
      "type": "subtask",
      "text": "пока игрок не кликнул по названию птицы из списка, в блоке выводится короткий текст с предложением послушать плеер и выбрать название птицы, чей голос прозвучал",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при клике по названию птицы из списка, в блоке с описанием птицы появляется информация о ней. Информация о птице включает: изображение, название (на русском и на латыни), аудиоплеер с записью голоса, дополнительное описание птицы",
      "max": 20
    },
    {
      "type": "title",
      "title": "Кнопка перехода к следующему вопросу +30"
    },
    {
      "type": "subtask",
      "text": "пока не выбран правильный ответ, кнопка не активна, нет возможности перейти к следующему заданию. Активное и неактивное состояние кнопки визуально отличаются",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "после правильного ответа на последний вопрос, клик по кнопке скрывает блок с вопросом, блок с вариантами ответов и блок с описанием птицы. Появляется сообщение с поздравлением об окончании игры:. Сообщение содержит количество набранных баллов из максимально возможных и кнопку с предложение сыграть ещё раз",
      "max": 20
    },
    {
      "type": "title",
      "title": "Extra scope +30"
    },
    {
      "type": "subtask",
      "text": "звуковая индикация правильного/неправильного ответа. При выборе правильного или неправильного ответа издаются разные звуковые сигналы. При выборе неправильного ответа проигрывание аудиоплеера не должно останавливаться. При выборе правильно ответа проигрывание аудиоплеера должно остановиться",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "Поздравление с абсолютной победой, если набрано максимально возможное количество баллов",
      "max": 10
    },
    {
      "type": "title",
      "title": "Штрафы"
    },
    {
      "type": "penalty",
      "text": "любой сбой/поломка приложения, связанная с действиями пользователя. Например, неправильный подсчёт баллов, нет перехода на следующую страницу, выводится неверная информация и т.д. Этот пункт не касается ошибок в консоли",
      "max": -20
    },
    {
      "type": "title",
      "title": "ссылки на лучшие работы добавьте, пожалуйста, в эту форму: https://forms.gle/4UUyQ2214iD7zqYk8"
    }
  ]
}
