{
  "taskName": "Songbird 2022-Q3",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/songbird/songbird-2022q3.md",
  "information": "Максимальный балл за задание: 270 баллов. Критерии оценки при cross-check:",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие. Проверяются только требования, указанные в критериях. Если какой-то момент в критериях не описан, его не проверяем и не оцениваем. Все сомнения трактуются на пользу студента"
    },
    {
      "type": "title",
      "title": "Если в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов. Если сомневаетесь снимать баллы или нет, не снимайте. Работа приложения проверяется в браузере Google Chrome последней версии. Адаптивность проверяем в Toggle device toolbar браузера Google Chrome"
    },
    {
      "type": "title",
      "title": "Обратите внимание, что вместо викторины с голосами птиц вы можете придумать и создать приложение на другую тематику - викторина по музыкальным произведениям, авторам, жанрам, фильмам, звуковым заставкам из компьютерных игр и т д. При этом в созданном приложении необходимо реализовать все перечисленные в задании требования и критерии. Количество раундов игры и вариантов ответа, должны быть не меньше чем в примере с \"Голосами птиц\"."
    },
    {
      "type": "title",
      "title": "Вёрстка, дизайн, UI всех трёх страниц приложения - 60"
    },
    {
      "type": "subtask",
      "text": "Стартовая страница приложения (вёрстка адаптивная - проверяется на ширине от 1920рх до 360рх)",
      "max": 20
    },
    {
      "type": "subtask",
      "text": "Страница викторины (вёрстка адаптивная - проверяется на ширине от 1920рх до 360рх)",
      "max": 30
    },
    {
      "type": "subtask",
      "text": "Страница с результатами (вёрстка адаптивная - проверяется на ширине от 1920рх до 360рх)",
      "max": 10
    },
    {
      "type": "title",
      "title": "Аудиоплеер +30"
    },
    {
      "type": "subtask",
      "text": "Есть хотя-бы стандартный HTML5 аудиоплеер",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Кастомный, функционал полностью такой же, как в <a href=\"https://birds-quiz.netlify.app/\" target=\"_blank\">демо</a> приложения, могут быть небольшие отличия в оформлении, например, может отличаться по цвету",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "У кастомного аудиоплеера есть регулятор громкости звука",
      "max": 10
    },
    {
      "type": "title",
      "title": "Верхняя панель страницы викторины - 20"
    },
    {
      "type": "subtask",
      "text": "Правильное отображение счета игры",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Текущий вопрос выделяется стилем",
      "max": 10
    },
    {
      "type": "title",
      "title": "Блок с вопросом - 20"
    },
    {
      "type": "subtask",
      "text": "Подстановка дефолтного изображения и замена названия птицы на символы (***), пока игрок не выберет правильный ответ",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При выборе правильного ответа в блоке с вопросом отображается изображение и название загаданной птицы",
      "max": 10
    },
    {
      "type": "title",
      "title": "Блок с вариантами ответов (названия птиц) - 60"
    },
    {
      "type": "subtask",
      "text": "Цветовая индикация правильного/неправильного ответа в виде индикаторов разного цвета рядом с названием птицы",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Звуковая индикация правильного/неправильного ответа: при выборе правильного или неправильного ответа издаются разные звуковые сигналы",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Звуковая индикация правильного/неправильного ответа: при выборе неправильного ответа проигрывание аудиоплеера не должно останавливаться",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Звуковая индикация правильного/неправильного ответа: при выборе правильно ответа проигрывание аудиоплеера должно остановиться",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При клике по названию птицы в блоке с описанием птицы отображается информация о ней",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Если правильный ответ уже дан, возможность просматривать описания птиц при клике по вариантам ответов остаётся, цвет индикаторов при этом не изменяется",
      "max": 10
    },
    {
      "type": "title",
      "title": "Блок с описанием птицы - 30"
    },
    {
      "type": "subtask",
      "text": "Пока игрок не кликнул по названию птицы из списка, в блоке выводится короткий текст с предложением послушать плеер и выбрать название птицы, чей голос прозвучал",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "При клике по названию птицы из списка, в блоке с описанием птицы появляется актуальная информация о ней<br>Информация о птице включает:<br> - изображение<br> - название (на русском и на латыни)<br> - аудиоплеер с записью голоса<br> - дополнительное описание птицы.",
      "max": 20
    },
    {
      "type": "title",
      "title": "Кнопка перехода к следующему вопросу - 30"
    },
    {
      "type": "subtask",
      "text": "Пока не выбран правильный ответ, кнопка не активна, нет возможности перейти к следующему заданию. Активное и неактивное состояние кнопки визуально отличаются, например, активная кнопка имеет зеленый, не активная - серый цвет",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "После правильного ответа на последний вопрос игрок переходит к странице с результатами викторины",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Страница с результатами содержит количество набранных баллов и кнопку с предложением сыграть ещё раз (или уведомление об окончании игры, если набрано максимальное количество баллов)",
      "max": 10
    },
    {
      "type": "title",
      "title": "Extra scope. Можно выбрать предложенные варианты или придумать свои, аналогичные им по сложности:"
    },
    {
      "type": "subtask",
      "text": "Локализация приложения на два языка, выбранный язык хранится в local storage и сохраняется при перезагрузке",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "Cоздание галереи всех птиц приложения c информацией о них (фото, аудио, название, описание)",
      "max": 10
    },
    {
      "type": "title",
      "title": "Штрафные баллы"
    },
    {
      "type": "penalty",
      "text": "Использование любыx js-библиотек и фреймворков в т.ч. jQuery",
      "max": -270
    },
    {
      "type": "penalty",
      "text": "Использование TypeScript",
      "max": -270
    }
  ]
}
