{
  "taskName": "speakit",
  "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/rslang/speakit.md",
  "criteria": [
    {
      "type": "title",
      "title": "Basic scope +30"
    },
    {
      "type": "subtask",
      "text": "вёрстка, дизайн, UI. Итерактивность кликабельных элементов, различные стили для активного и неактивного состояния. Есть стартовый экран",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "когда приложение открывается, на странице отображается группа из 10 слов, возле каждого слова его транскрипция и иконка аудио. При клике по слову звучит его произношение",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "при клике по слову изменяется его стиль и отображается соответствующая ему картинка",
      "max": 10
    },
    {
      "type": "title",
      "title": "Advanced scope +60"
    },
    {
      "type": "subtask",
      "text": "при клике по слову отображается его перевод. **Если у вас не отображаются переводы слов, проверьте, не связано ли это с блокировкой Яндекса",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "если распознавание речи включено, и приложению разрешён доступ к микрофону, все произнесённые пользователем слова распознаются и отображаются в текстовом виде",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "проверка правильности произношения происходит путём сравнения распознанного текста с написанием слова. Если слово распознано верно, изменяется стиль его отображения, а результат игры увеличивается на один балл",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "у пользователя есть возможность просмотреть результат игры. Также результат отображается, если все слова распознаны верно. На странице с результатом есть кнопки, позволяющие вернуться к предыдущей игре или запустить новую игру с новым набором слов",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "на странице результата игры отображаются правильно угаданные слова и слова, в которых были допущены ошибки. Возле каждого слова отображаются его транскрипция, перевод, иконка аудио. По клику по слову звучит его произношение",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "у пользователя есть возможность изменять сложность мини-игры. Всего шесть уровней сложности, которым соответствуют шесть частей коллекции исходных данных",
      "max": 10
    },
    {
      "type": "title",
      "title": "Hacker scope +10"
    },
    {
      "type": "subtask",
      "text": "ведётся долгосрочная статистика мини-игры, можно посмотреть когда (дата и время) и с каким результатом в неё играли. После перезагрузки приложения статистика сохраняется",
      "max": 10
    },
    {
      "type": "subtask",
      "text": "реализован дополнительный, не предусмотренный заданием функционал. Данный пункт не оценивается",
      "max": 0
    }
  ]
}
