{
    "taskName": "Travel#3",
    "github": "https://github.com/rolling-scopes-school/tasks/blob/master/tasks/travel/travel-part3.md",
    "criteria": [
      {
        "type": "title",
        "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем."
      },
      {
        "type": "title",
        "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nВсе сомнения трактуются на пользу студента\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
      },
      {
        "type": "title",
        "title": "Слайдер изображений в секции destinations +50"
      },
      {
        "type": "subtask",
        "text": "на десктоп варианте при клике на урезанную картинку слева или справа изображение меняется по принципу карусели (например если нажать правую картинку та что была в центре на уезжает налево, а та что была видна наполовину оказывается справа). Слайдер может быть как конечным так и бесконечным - данный критерий не должен влиять на оценку",
        "max": 20
      },
      {
        "type": "subtask",
        "text": "Три точки внизу отображают \"номер слайда\", то есть каждому слайду соответствует свой кружочек, который становится активным при нахождении соответствующего ему слайда в центре. На мобильном варианте картинка одна, но поверх нее появляются стрелочки навигации (можно сделать как карусель или же затемнять кнопку если слайдер достиг края)",
        "max": 20
      },
      {
        "type": "subtask",
        "text": "Анимации плавного перемещения для слайдера",
        "max": 10
      },
      {
        "type": "title",
        "title": "Нажатие на кнопку Login (кнопка Account в мобильной версии) показывает сверстанный логин попап + 50"
      },
      {
        "type": "subtask",
        "text": "логин попап соответствует верстке его закрытие происходит при клике вне попапа",
        "max": 25
      },
      {
        "type": "subtask",
        "text": "логин попап имеет 2 инпута (логин и пароль) при нажатии на кнопку Sign In показывается браузерный алерт с введенными данными (для реализации можно использовать тег)",
        "max": 25
      },
      {
        "type": "title",
        "title": "Дополнительный функционал +25"
      },
      {
        "type": "subtask",
        "text": "Нажатие на кнопку Register на Login попапе меняет разметку попапа на разметку Sign Up попапа согласно макету (То есть нажатие не закрывает модал а просто меняет его наполнение)",
        "max": 25
      }
    ]
  }
  
