{
  "taskName": "virtual-piano",
  "github": "",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nВсе сомнения трактуются на пользу студента\nЕсли в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов\nЕсли сомневаетесь снимать баллы или нет, не снимайте\nВидеоинструкция по проведению cross-check: https://www.youtube.com/watch?v=gqOY9b9Ihp4&t=721s"
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется на компьютере в браузере Google Chrome последней версии\nСовместная работа и взаимодействие мыши и клавиатуры или нескольких клавиш клавиатуры не проверяется и не оценивается.\nКлики правой кнопкой мыши не проверяются и не оцениваются.\nКлики в промежутках между любыми клавишами пианино и на границах клавиш не проверяются и не оцениваются"
    },
    {
      "type": "subtask",
      "text": "при клике по клавише пианино мышкой проигрывается соответствующая этой клавише нота. Все клавиши пианино проигрывают соответствующие им ноты; если кликнуть по клавише пианино несколько раз подряд, каждый раз проигрывается нота; при клике по буквам или нотам звука быть не должно; если кликнуть по клавише пианино мышкой и оставить кнопку мышки зажатой, происходит однократное проигрывание звука",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по клавише пианино мышкой клавиша переходит в активное состояние. Все клавиши пианино при клике переходят в активное состояние; если кликнуть по клавише пианино несколько раз подряд, каждый раз клавиша переходят в активное состояние; при клике по буквам или нотам клавиши пианино НЕ переходят в активное состояние; активное состояние клавиши пианино сохраняется до тек пор, пока над ней находится зажатая кнопка мышки",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по клавише клавиатуры, которая соответствует клавише пианино, проигрывается нота. Нота проигрывается вне зависимости от того какая кнопка является активной `Notes` или `Letters`; нота проигрывается вне зависимости от раскладки клавиатуры (русская или английская); нота проигрывается вне зависимости от активности клавиши `CapsLock`; если зажать клавишу клавиатуры на одной клавише пианино, происходит однократное проигрывание звука",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по клавише клавиатуры, которая соответствует клавише пианино, клавиша пианино переходит в активное состояние. Клавиша пианино становится активной вне зависимости от того какая кнопка является активной `Notes` или `Letters`; клавиша пианино становится активной вне зависимости от раскладки клавиатуры (русская или английская); клавиша пианино становится активной вне зависимости от активности клавиши `CapsLock`; активное состояние клавиши пианино сохраняется до тек пор, пока зажата соответствующая ей клавиша клавиатуры",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "можно провести курсором мышки с зажатой левой кнопкой по клавишам пианино, при этом будут проигрываться соответствующие данным клавишам ноты. Звук не проигрывается, если проводить по буквам или нотам; данная возможность работает только если нажимать мышкой над клавишами пианино (не в любом месте приложения); если курсор с зажатой левой кнопокой мышки увести за пределы клавиатуры и не отпуская левую кнопку снова провести над клавиатурой, ноты проигрываются; если курсор с зажатой левой кнопокой мышки увести за пределы клавиатуры, отпустить левую кнопку и снова провести над клавиатурой, ноты НЕ проигрываются; если проводить мышкой очень быстро, отдельные клавиши могут не проигрываться, эта особенность работы мышки ошибкой не является",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "можно провести курсором мышки с зажатой левой кнопкой по клавишам пианино, при этом клавиши, над которыми в данный момент находится курсор, переходят в активное состояние. Клавиши пианино не переходят в активное состояние, если проводить по буквам или нотам; данная возможность работает только если нажимать мышкой над клавишами пианино (не в любом месте приложения); если курсор с зажатой левой кнопокой мышки увести за пределы клавиатуры и не отпуская левую кнопку снова провести над клавиатурой, клавиши пианино переходят в активное состояние; если курсор с зажатой левой кнопокой мышки увести за пределы клавиатуры, отпустить левую кнопку и снова провести над клавиатурой, клавиши пианино не переходят в активное состояние; в активном состоянии находится только та клавиша пианино, над которой в данный момент находится курсор",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "у клавиш пианино и соответствующих им букв или нот есть три состояния, которые отличаются по стилю: активное состояние, неактивное состояние,  состояние при наведении. Разные стили включают в себя: разный цвет клавиш, трансформацию клавиш, разный цвет соответствующих клавишам букв и нот; дополнительно к перечисленным могут быть другие отличия стилей на ваше усмотрение",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "при клике по переключателю Notes/Letters сменяется отображение возле клавиш пианино названий соответствующих этим клавишам нот или букв. При повторном нажатии на кнопку, которая активна, не происходит переключение `Notes/Letters` и не сменяются ноты или буквы",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "активное и неактивное состояние кнопок переключателя отличаются по стилю. При повторном нажатии на кнопку, которая активна, не происходит переключение `Notes/Letters`, неактивная кнопка не становится активной",
      "max": 5
    },
    {
      "type": "subtask",
      "text": "реализована функциональность кнопки Fullscreen, которая позволяет развернуть приложение во весь экран, выйти из полноэкранного режима, в полноэкранном режиме взаимодействует с клавишей Esc клавиатуры. Когда приложение развернуто в полноэкранном режиме, то нажатие кнопки `Fullscreen` возвращает приложение в оконный режим; когда приложение развернуто в полноэкранном режиме, то нажатие клавиши клавиатуры `Esc` возвращает приложение в оконный режим; стиль кнопки в оконном режиме отличается от стиля кнопки в полноэкранном режиме",
      "max": 5
    },
    {
      "type": "penalty",
      "text": "обоснованные подозрение на списывание (js-код работы полностью повторяет код источника в интернете), работы с минимизированным или обфусцированным js-кодом, работы с использованием jQuery или других js-библиотек, работы с крайне низким качеством оформления - 0 баллов за кросс-чек. Ссылки на такие работы необходимо отправить модератору курса",
      "max": -50
    },
    {
      "type": "penalty",
      "text": "Минус один балл за каждую ошибку в работе приложения (нужно будет подсчитать вручную)",
      "max": -1
    },
    {
      "type": "title",
      "title": "ссылки на лучшие работы с качественным оригинальным оформлением или реализованным дополнительным функционалом, добавьте, пожалуйста, в эту форму https://forms.gle/BFGAF88zZADwRkKV7"
    }
  ]
}
