{
  "taskName": "wildlife",
  "criteria": [
    {
      "type": "title",
      "title": "Уважаемые проверяющие.\nПроверяются только требования, указанные в критериях.\nЕсли какой-то момент в критериях не описан, его не проверяем и не оцениваем.\nВсе сомнения трактуются на пользу студента\nЕсли в работе сделано больше, чем требуется в задании, это не является поводом для снижения баллов\nЕсли сомневаетесь снимать баллы или нет, не снимайте"
    },
    {
      "type": "title",
      "title": "Работа приложения проверяется в браузере Google Chrome последней версии"
    },
    {
      "type": "title",
      "title": "Блок Header +10"
    },
    {
      "type": "subtask",
      "text": "Блок Header содержит только логотип и панель навигации. Наличие блоков-обёрток во внимание не принимаем",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Логотип содержит два элемента - svg-иконку и текст. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "На странице обязательно должен присутствовать один элемент h1. Расположите его на свое усмотрение. Не проверяем какой именно элемент указан как h1, главное, чтобы он был и был только один",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Панель навигации состоит из четырёх элементов: двух ссылок, иконки поиска и кнопки \"Sign in\" . Верстается в виде ненумерованного списка: ul > li > a. Если кнопка \"Sign in\" верстается не как ссылка, а тегом button, это не ошибка",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Все элементы панели навигации должны быть интерактивными",
      "max": 2
    },
    {
      "type": "title",
      "title": "Блок Survival +10"
    },
    {
      "type": "subtask",
      "text": "Расстояние между буквами заголовка регулируется css-свойством letter-spacing",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Разрывы строк в текстовом блоке регулируются шириной блока без использования тега br",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Кнопка Donate интерактивная. Используются указанные в макете стили для различных состояний кнопки",
      "max": 3
    },
    {
      "type": "subtask",
      "text": "У блоков Header и Survival общее фоновое изображение",
      "max": 3
    },
    {
      "type": "title",
      "title": "Блок Latest articles +10"
    },
    {
      "type": "subtask",
      "text": "Для вёрстки трёх изображений в ряд лучше использовать flexbox или grid. Float использовать можно. table - нельзя",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "Надписи поверх изображений можно разместить при помощи абсолютного позиционирования. Менее семантически правильный, но более простой в реализации вариант - использовать для добавления изображений css-свойство background-image",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "Стрелки слайдера интерактивны",
      "max": 2
    },
    {
      "type": "title",
      "title": "Блок Get notified +10"
    },
    {
      "type": "subtask",
      "text": "Для отправки данных используется тег form",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "Поле email верстается тегом input с типом text или email (оба варианта допустимы), поле send верстается тегом input с типом submit",
      "max": 4
    },
    {
      "type": "subtask",
      "text": "Надпись email - это placeholder",
      "max": 2
    },
    {
      "type": "title",
      "title": "Блок Footer +10"
    },
    {
      "type": "subtask",
      "text": "Блок Footer содержит логотип, дополнительную панель навигации и ссылки на социальные сети",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Логотип полностью повторяет логотип блока Header. Речь о визуальном сходстве, а не использовании точно таких же тегов",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Дополнительная панель навигации и ссылки на социальные сети верстаются в виде ненумерованных списков: ul > li > a",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Иконки социальных сетей верстаются с использованием svg-файлов в качестве фоновых изображений",
      "max": 2
    },
    {
      "type": "subtask",
      "text": "Все ссылки в футере должны быть интерактивными",
      "max": 2
    },
    {
      "type": "title",
      "title": "Штрафные баллы"
    },
    {
      "type": "penalty",
      "text": "В блоке Header визуальные отличия элементов или блоков составляют более 5px по горизонтали или более 10рх по вертикали. Проверяем только положение элементов на странице, на возможные отличия в положении фонового изображения внимания не обращаем, баллы за это не снимаем",
      "max": -2
    },
    {
      "type": "penalty",
      "text": "В блоке Survival визуальные отличия элементов или блоков составляют более 5px по горизонтали или более 10рх по вертикали",
      "max": -2
    },
    {
      "type": "penalty",
      "text": "В блоке Latest articles визуальные отличия элементов или блоков составляют более 5px по горизонтали или более 10рх по вертикали",
      "max": -2
    },
    {
      "type": "penalty",
      "text": "В блоке Get notified визуальные отличия элементов или блоков составляют более 5px по горизонтали или более 10рх по вертикали",
      "max": -2
    },
    {
      "type": "penalty",
      "text": "В блоке Footer визуальные отличия элементов или блоков составляют более 5px по горизонтали или более 10рх по вертикали. Проверяем только положение элементов на странице, на возможные отличия в положении фонового изображения внимания не обращаем, баллы за это не снимаем",
      "max": -2
    }
  ]
}
